{
  "https://www.gov.za/documents/constitution/constitution-republic-south-africa-1996-chapter-1-founding-provisions-04-feb": "Republic of South Africa\n\nSupremacy of the Constitution\n\nCitizenship\n\nNational Anthem\n\nNational Flag\n\nLanguages\n\n1. Republic of South Africa\n\nThe Republic of South Africa is one, sovereign, democratic state founded on the following values:\n\na. Human dignity, the achievement of equality and the advancement of human rights and freedoms.\n\nb. Non-racialism and non-sexism.\n\nc. Supremacy of the constitution and the rule of law.\n\nd. Universal adult suffrage, a national common voters roll, regular elections and a multi-party system of democratic government, to ensure accountability, responsiveness and openness.\n\n2. Supremacy of Constitution\n\nThis Constitution is the supreme law of the Republic; law or conduct inconsistent with it is invalid, and the obligations imposed by it must be fulfilled.\n\n3. Citizenship\n\n1. There is a common South African citizenship.\n\n2. All citizens are ­\n\na. equally entitled to the rights, privileges and benefits of citizenship; and\n\nb. equally subject to the duties and responsibilities of citizenship.\n\n3. National legislation must provide for the acquisition, loss and restoration of citizenship.\n\n4. National anthem\n\nThe national anthem of the Republic is determined by the President by proclamation.\n\n5. National flag\n\nThe national flag of the Republic is black, gold, green, white, red and blue, as described and sketched in Schedule 1 .\n\n6. Languages\n\n1. The official languages of the Republic are Sepedi, Sesotho, Setswana, siSwati, Tshivenda, Xitsonga, Afrikaans, English, isiNdebele, isiXhosa and isiZulu.\n\n2. Recognising the historically diminished use and status of the indigenous languages of our people, the state must take practical and positive measures to elevate the status and advance the use of these languages.\n\n3.         a. Municipalities must take into account the language usage and preferences of their residents.\n\nb. The national government and provincial governments may use any particular official languages for the purposes of government, taking into account usage, practicality, expense, regional circumstances and the balance of the needs and preferences of the population as a whole or in the province concerned; but the national government and each provincial government must use at least two official languages.\n\n4. The national government and provincial governments, by legislative and other measures, must regulate and monitor their use of official languages. Without detracting from the provisions of subsection (2), all official languages must enjoy parity of esteem and must be treated equitably.\n\n5. A Pan South African Language Board established by national legislation must ­\n\na. promote, and create conditions for, the development and use of ­\n\ni. all official languages;\n\nii. the Khoi, Nama and San languages; and\n\niii. sign language ; and\n\nb. promote and ensure respect for ­\n\ni. all languages commonly used by communities in South Africa, including German, Greek, Gujarati, Hindi, Portuguese, Tamil, Telegu and Urdu; and\n\nii. Arabic, Hebrew, Sanskrit and other languages used for religious purposes in South Africa.\n\n\n\n- Translations in all official South African languages",
  "https://www.gov.za/documents/constitution/chapter-2-bill-rights": "Rights\n\nApplication\n\nEquality\n\nHuman Dignity\n\nLife\n\nFreedom and Security of the Person\n\nSlavery, Servitude and Forced Labour\n\nPrivacy\n\nFreedom of Religion, Belief and Opinion\n\nFreedom of Expression\n\nAssembly, Demonstration, Picket and Petition\n\nFreedom of Association\n\nPolitical Rights\n\nCitizenship\n\nFreedom of Movement and Residence\n\nFreedom of Trade, Occupation and Profession\n\nLabour Relations\n\nEnvironment\n\nProperty\n\nHousing\n\nHealth Care, Food Water and Social Security\n\nChildren\n\nEducation\n\nLanguage and Culture\n\nCultural, Religious and Linguistic Communities\n\nAccess to Information\n\nJust Administrative Action\n\nAccess to Courts\n\nArrested, Detained and Accused Persons\n\nLimitation of Rights\n\nStates of Emergency\n\nEnforcement of Rights\n\nInterpretation of Bill of Rights\n\n7. Rights\n\n1. This Bill of Rights is a cornerstone of democracy in South Africa. It enshrines the rights of all people in our country and affirms the democratic values of human dignity, equality and freedom.\n\n2. The state must respect, protect, promote and fulfil the rights in the Bill of Rights.\n\n3. The rights in the Bill of Rights are subject to the limitations contained or referred to in section 36, or elsewhere in the Bill.\n\n8. Application\n\n1. The Bill of Rights applies to all law, and binds the legislature, the executive, the judiciary and all organs of state.\n\n2. A provision of the Bill of Rights binds a natural or a juristic person if, and to the extent that, it is applicable, taking into account the nature of the right and the nature of any duty imposed by the right.\n\n3. When applying a provision of the Bill of Rights to a natural or juristic person in terms of subsection (2), a court ­\n\na. in order to give effect to a right in the Bill, must apply, or if necessary develop, the common law to the extent that legislation does not give effect to that right; and\n\nb. may develop rules of the common law to limit the right, provided that the limitation is in accordance with section 36(1).\n\n4. A juristic person is entitled to the rights in the Bill of Rights to the extent required by the nature of the rights and the nature of that juristic person.\n\n9. Equality\n\n1. Everyone is equal before the law and has the right to equal protection and benefit of the law.\n\n2. Equality includes the full and equal enjoyment of all rights and freedoms. To promote the achievement of equality, legislative and other measures designed to protect or advance persons, or categories of persons, disadvantaged by unfair discrimination may be taken.\n\n3. The state may not unfairly discriminate directly or indirectly against anyone on one or more grounds, including race, gender, sex, pregnancy, marital status, ethnic or social origin, colour, sexual orientation, age, disability, religion, conscience, belief, culture, language and birth.\n\n4. No person may unfairly discriminate directly or indirectly against anyone on one or more grounds in terms of subsection (3). National legislation must be enacted to prevent or prohibit unfair discrimination.\n\n5. Discrimination on one or more of the grounds listed in subsection (3) is unfair unless it is established that the discrimination is fair.\n\n10. Human dignity\n\nEveryone has inherent dignity and the right to have their dignity respected and protected.\n\n11. Life\n\nEveryone has the right to life.\n\n12. Freedom and security of the person\n\n1. Everyone has the right to freedom and security of the person, which includes the right ­\n\na. not to be deprived of freedom arbitrarily or without just cause;\n\nb. not to be detained without trial;\n\nc. to be free from all forms of violence from either public or private sources;\n\nd. not to be tortured in any way; and\n\ne. not to be treated or punished in a cruel, inhuman or degrading way.\n\n2. Everyone has the right to bodily and psychological integrity, which includes the right ­\n\na. to make decisions concerning reproduction;\n\nb. to security in and control over their body; and\n\nc. not to be subjected to medical or scientific experiments without their informed consent.\n\n13. Slavery, servitude and forced labour\n\nNo one may be subjected to slavery, servitude or forced labour.\n\n14. Privacy\n\nEveryone has the right to privacy, which includes the right not to have ­\n\na. their person or home searched;\n\nb. their property searched;\n\nc. their possessions seized; or\n\nd. the privacy of their communications infringed.\n\n15. Freedom of religion, belief and opinion\n\n1. Everyone has the right to freedom of conscience, religion, thought, belief and opinion.\n\n2. Religious observances may be conducted at state or state-aided institutions, provided that ­\n\na. those observances follow rules made by the appropriate public authorities;\n\nb. they are conducted on an equitable basis; and\n\nc. attendance at them is free and voluntary.\n\n3.         a. This section does not prevent legislation recognising ­\n\ni. marriages concluded under any tradition, or a system of religious, personal or family law; or\n\nii. systems of personal and family law under any tradition, or adhered to by persons professing a particular religion.\n\nb. Recognition in terms of paragraph (a) must be consistent with this section and the other provisions of the Constitution.\n\n16. Freedom of expression\n\n1. Everyone has the right to freedom of expression, which includes ­\n\na. freedom of the press and other media;\n\nb. freedom to receive or impart information or ideas;\n\nc. freedom of artistic creativity; and\n\nd. academic freedom and freedom of scientific research.\n\n2. The right in subsection (1) does not extend to ­\n\na. propaganda for war;\n\nb. incitement of imminent violence; or\n\nc. advocacy of hatred that is based on race, ethnicity, gender or religion, and that constitutes incitement to cause harm.\n\n17. Assembly, demonstration, picket and petition\n\nEveryone has the right, peacefully and unarmed, to assemble, to demonstrate, to picket and to present petitions.\n\n18. Freedom of association\n\nEveryone has the right to freedom of association.\n\n19. Political rights\n\n1. Every citizen is free to make political choices, which includes the right\n\na. to form a political party;\n\nb. to participate in the activities of, or recruit members for, a political party; and\n\nc. to campaign for a political party or cause.\n\n2. Every citizen has the right to free, fair and regular elections for any legislative body established in terms of the Constitution.\n\n3. Every adult citizen has the right ­\n\na. to vote in elections for any legislative body established in terms of the Constitution, and to do so in secret; and\n\nb. to stand for public office and, if elected, to hold office.\n\n20. Citizenship\n\nNo citizen may be deprived of citizenship.\n\n21. Freedom of movement and residence\n\n1. Everyone has the right to freedom of movement.\n\n2. Everyone has the right to leave the Republic.\n\n3. Every citizen has the right to enter, to remain in and to reside anywhere in, the Republic.\n\n4. Every citizen has the right to a passport.\n\n22. Freedom of trade, occupation and profession\n\nEvery citizen has the right to choose their trade, occupation or profession freely. The practice of a trade, occupation or profession may be regulated by law.\n\n23. Labour relations\n\n1. Everyone has the right to fair labour practices.\n\n2. Every worker has the right ­\n\na. to form and join a trade union;\n\nb. to participate in the activities and programmes of a trade union; and\n\nc. to strike.\n\n3. Every employer has the right ­\n\na. to form and join an employers' organisation; and\n\nb. to participate in the activities and programmes of an employers' organisation.\n\n4. Every trade union and every employers' organisation has the right ­\n\na. to determine its own administration, programmes and activities;\n\nb. to organise; and\n\nc. to form and join a federation.\n\n5. Every trade union, employers' organisation and employer has the right to engage in collective bargaining. National legislation may be enacted to regulate collective bargaining. To the extent that the legislation may limit a right in this Chapter, the limitation must comply with section 36(1).\n\n6. National legislation may recognise union security arrangements contained in collective agreements. To the extent that the legislation may limit a right in this Chapter, the limitation must comply with section 36(1).\n\n24. Environment\n\nEveryone has the right ­\n\na. to an environment that is not harmful to their health or well-being; and\n\nb. to have the environment protected, for the benefit of present and future generations, through reasonable legislative and other measures that ­\n\ni. prevent pollution and ecological degradation;\n\nii. promote conservation; and\n\niii. secure ecologically sustainable development and use of natural resources while promoting justifiable economic and social development.\n\n25. Property\n\n1. No one may be deprived of property except in terms of law of general application, and no law may permit arbitrary deprivation of property.\n\n2. Property may be expropriated only in terms of law of general application ­\n\na. for a public purpose or in the public interest; and\n\nb. subject to compensation, the amount of which and the time and manner of payment of which have either been agreed to by those affected or decided or approved by a court.\n\n3. The amount of the compensation and the time and manner of payment must be just and equitable, reflecting an equitable balance between the public interest and the interests of those affected, having regard to all relevant circumstances, including ­\n\na. the current use of the property;\n\nb. the history of the acquisition and use of the property;\n\nc. the market value of the property;\n\nd. the extent of direct state investment and subsidy in the acquisition and beneficial capital improvement of the property; and\n\ne. the purpose of the expropriation.\n\n4. For the purposes of this section ­\n\na. the public interest includes the nation's commitment to land reform, and to reforms to bring about equitable access to all South Africa's natural resources; and\n\nb. property is not limited to land.\n\n5. The state must take reasonable legislative and other measures, within its available resources, to foster conditions which enable citizens to gain access to land on an equitable basis.\n\n6. A person or community whose tenure of land is legally insecure as a result of past racially discriminatory laws or practices is entitled, to the extent provided by an Act of Parliament, either to tenure which is legally secure or to comparable redress.\n\n7. A person or community dispossessed of property after 19 June 1913 as a result of past racially discriminatory laws or practices is entitled, to the extent provided by an Act of Parliament, either to restitution of that property or to equitable redress.\n\n8. No provision of this section may impede the state from taking legislative and other measures to achieve land, water and related reform, in order to redress the results of past racial discrimination, provided that any departure from the provisions of this section is in accordance with the provisions of section 36(1).\n\n9. Parliament must enact the legislation referred to in subsection (6).\n\n26. Housing\n\n1. Everyone has the right to have access to adequate housing.\n\n2. The state must take reasonable legislative and other measures, within its available resources, to achieve the progressive realisation of this right.\n\n3. No one may be evicted from their home, or have their home demolished, without an order of court made after considering all the relevant circumstances. No legislation may permit arbitrary evictions.\n\n27. Health care, food, water and social security\n\n1. Everyone has the right to have access to ­\n\na. health care services, including reproductive health care;\n\nb. sufficient food and water; and\n\nc. social security, including, if they are unable to support themselves and their dependants, appropriate social assistance.\n\n2. The state must take reasonable legislative and other measures, within its available resources, to achieve the progressive realisation of each of these rights.\n\n3. No one may be refused emergency medical treatment.\n\n28. Children\n\n1. Every child has the right ­\n\na. to a name and a nationality from birth;\n\nb. to family care or parental care, or to appropriate alternative care when removed from the family environment;\n\nc. to basic nutrition, shelter, basic health care services and social services;\n\nd. to be protected from maltreatment, neglect, abuse or degradation;\n\ne. to be protected from exploitative labour practices;\n\nf. not to be required or permitted to perform work or provide services that ­\n\ni. are inappropriate for a person of that child's age; or\n\nii. place at risk the child's well-being, education, physical or mental health or spiritual, moral or social development;\n\ng. not to be detained except as a measure of last resort, in which case, in addition to the rights a child enjoys under sections 12 and 35, the child may be detained only for the shortest appropriate period of time, and has the right to be ­\n\ni. kept separately from detained persons over the age of 18 years; and\n\nii. treated in a manner, and kept in conditions, that take account of the child's age;\n\nh. to have a legal practitioner assigned to the child by the state, and at state expense, in civil proceedings affecting the child, if substantial injustice would otherwise result; and\n\ni. not to be used directly in armed conflict, and to be protected in times of armed conflict.\n\n2. A child's best interests are of paramount importance in every matter concerning the child.\n\n3. In this section \"child\" means a person under the age of 18 years.\n\n29. Education\n\n1. Everyone has the right ­\n\na. to a basic education, including adult basic education; and\n\nb. to further education, which the state, through reasonable measures, must make progressively available and accessible.\n\n2. Everyone has the right to receive education in the of ficial language or languages of their choice in public educational institutions where that education is reasonably practicable. In order to ensure the effective access to, and implementation of, this right, the state must consider all reasonable educational alternatives, including single medium institutions, taking into account ­\n\na. equity;\n\nb. practicability; and\n\nc. the need to redress the results of past racially discriminatory laws and practices.\n\n3. Everyone has the right to establish and maintain, at their own expense, independent educational institutions that ­\n\na. do not discriminate on the basis of race;\n\nb. are registered with the state; and\n\nc. maintain standards that are not inferior to standards at comparable public educational institutions.\n\n4. Subsection (3) does not preclude state subsidies for independent educational institutions.\n\n30. Language and culture\n\nEveryone has the right to use the language and to participate in the cultural life of their choice, but no one exercising these rights may do so in a manner inconsistent with any provision of the Bill of Rights.\n\n31. Cultural, religious and linguistic communities\n\n1. Persons belonging to a cultural, religious or linguistic community may not be denied the right, with other members of that community ­\n\na. to enjoy their culture, practise their religion and use their language; and\n\nb. to form, join and maintain cultural, religious and linguistic associations and other organs of civil society.\n\n2. The rights in subsection (1) may not be exercised in a manner inconsistent with any provision of the Bill of Rights.\n\n32. Access to information\n\n1. Everyone has the right of access to ­\n\na. any information held by the state; and\n\nb. any information that is held by another person and that is required for the exercise or protection of any rights.\n\n2. National legislation must be enacted to give effect to this right, and may provide for reasonable measures to alleviate the administrative and financial burden on the state.\n\n33. Just administrative action\n\n1. Everyone has the right to administrative action that is lawful, reasonable and procedurally fair.\n\n2. Everyone whose rights have been adversely affected by administrative action has the right to be given written reasons.\n\n3. National legislation must be enacted to give effect to these rights, and must ­\n\na. provide for the review of administrative action by a court or, where appropriate, an independent and impartial tribunal;\n\nb. impose a duty on the state to give effect to the rights in subsections (1) and (2); and\n\nc. promote an efficient administration.\n\n34. Access to courts\n\nEveryone has the right to have any dispute that can be resolved by the application of law decided in a fair public hearing before a court or, where appropriate, another independent and impartial tribunal or forum.\n\n35. Arrested, detained and accused persons\n\n1. Everyone who is arrested for allegedly committing an offence has the right ­\n\na. to remain silent;\n\nb. to be informed promptly ­\n\ni. of the right to remain silent; and\n\nii. of the consequences of not remaining silent;\n\nc. not to be compelled to make any confession or admission that could be used in evidence against that person;\n\nd. to be brought before a court as soon as reasonably possible, but not later than ­\n\ni. 48 hours after the arrest; or\n\nii. the end of the first court day after the expiry of the 48 hours, if the 48 hours expire outside ordinary court hours or on a day which is not an ordinary court day;\n\ne. at the first court appearance after being arrested, to be charged or to be informed of the reason for the detention to continue, or to be released; and\n\nf. to be released from detention if the interests of justice permit, subject to reasonable conditions.\n\n2. Everyone who is detained, including every sentenced prisoner, has the right ­\n\na. to be informed promptly of the reason for being detained;\n\nb. to choose, and to consult with, a legal practitioner, and to be informed of this right promptly;\n\nc. to have a legal practitioner assigned to the detained person by the state and at state expense, if substantial injustice would otherwise result, and to be informed of this right promptly;\n\nd. to challenge the lawfulness of the detention in person before a court and, if the detention is unlawful, to be released;\n\ne. to conditions of detention that are consistent with human dignity, including at least exercise and the provision, at state expense, of adequate accommodation, nutrition, reading material and medical treatment; and\n\nf. to communicate with, and be visited by, that person's ­\n\ni. spouse or partner;\n\nii. next of kin;\n\niii. chosen religious counsellor; and\n\niv. chosen medical practitioner.\n\n3. Every accused person has a right to a fair trial, which includes the right ­\n\na. to be informed of the charge with sufficient detail to answer it;\n\nb. to have adequate time and facilities to prepare a defence;\n\nc. to a public trial before an ordinary court;\n\nd. to have their trial begin and conclude without unreasonable delay;\n\ne. to be present when being tried;\n\nf. to choose, and be represented by, a legal practitioner, and to be informed of this right promptly;\n\ng. to have a legal practitioner assigned to the accused person by the state and at state expense, if substantial injustice would otherwise result, and to be informed of this right promptly;\n\nh. to be presumed innocent, to remain silent, and not to testify during the proceedings;\n\ni. to adduce and challenge evidence;\n\nj. not to be compelled to give self-incriminating evidence;\n\nk. to be tried in a language that the accused person understands or, if that is not practicable, to have the proceedings interpreted in that language;\n\nl. not to be convicted for an act or omission that was not an offence under either national or international law at the time it was committed or omitted;\n\nm. not to be tried for an offence in respect of an act or omission for which that person has previously been either acquitted or convicted;\n\nn. to the benefit of the least severe of the prescribed punishments if the prescribed punishment for the offence has been changed between the time that the offence was committed and the time of sentencing; and\n\no. of appeal to, or review by, a higher court.\n\n4. Whenever this section requires information to be given to a person, that information must be given in a language that the person understands.\n\n5. Evidence obtained in a manner that violates any right in the Bill of Rights must be excluded if the admission of that evidence would render the trial unfair or otherwise be detrimental to the administration of justice.\n\n36. Limitation of rights\n\n1. The rights in the Bill of Rights may be limited only in terms of law of general application to the extent that the limitation is reasonable and justifiable in an open and democratic society based on human dignity, equality and freedom, taking into account all relevant factors, including ­\n\na. the nature of the right;\n\nb. the importance of the purpose of the limitation;\n\nc. the nature and extent of the limitation;\n\nd. the relation between the limitation and its purpose; and\n\ne. less restrictive means to achieve the purpose.\n\n2. Except as provided in subsection (1) or in any other provision of the Constitution, no law may limit any right entrenched in the Bill of Rights.\n\n37. States of emergency\n\n1. A state of emergency may be declared only in terms of an Act of Parliament, and only when ­\n\na. the life of the nation is threatened by war, invasion, general insurrection, disorder, natural disaster or other public emergency; and\n\nb. the declaration is necessary to restore peace and order.\n\n2. A declaration of a state of emergency, and any legislation enacted or other action taken in consequence of that declaration, may be effective only ­\n\na. prospectively; and\n\nb. for no more than 21 days from the date of the declaration, unless the National Assembly resolves to extend the declaration. The Assembly may extend a declaration of a state of emergency for no more than three months at a time. The first extension of the state of emergency must be by a resolution adopted with a supporting vote of a majority of the members of the Assembly. Any subsequent extension must be by a resolution adopted with a supporting vote of at least 60 per cent of the members of the Assembly. A resolution in terms of this paragraph may be adopted only following a public debate in the Assembly.\n\n3. Any competent court may decide on the validity of ­\n\na. a declaration of a state of emergency;\n\nb. any extension of a declaration of a state of emergency; or\n\nc. any legislation enacted, or other action taken, in consequence of a declaration of a state of emergency.\n\n4. Any legislation enacted in consequence of a declaration of a state of emergency may derogate from the Bill of Rights only to the extent that ­\n\na. the derogation is strictly required by the emergency; and\n\nb. the legislation ­\n\ni. is consistent with the Republic's obligations under international law applicable to states of emergency;\n\nii. conforms to subsection (5); and\n\niii. is published in the national Government Gazette as soon as reasonably possible after being enacted.\n\n5. No Act of Parliament that authorises a declaration of a state of emergency, and no legislation enacted or other action taken in consequence of a declaration, may permit or authorise ­\n\na. indemnifying the state, or any person, in respect of any unlawful act;\n\nb. any derogation from this section; or\n\nc. any derogation from a section mentioned in column 1 of the Table of Non-Derogable Rights, to the extent indicated opposite that section in column 3 of the Table.\n\nTable of Non-Derogable Rights\n\n6. Whenever anyone is detained without trial in consequence of a derogation of rights resulting from a declaration of a state of emergency, the following conditions must be observed:\n\na. An adult family member or friend of the detainee must be contacted as soon as reasonably possible, and informed that the person has been detained.\n\nb. A notice must be published in the national Government Gazette within five days of the person being detained, stating the detainee's name and place of detention and referring to the emergency measure in terms of which that person has been detained.\n\nc. The detainee must be allowed to choose, and be visited at any reasonable time by, a medical practitioner.\n\nd. The detainee must be allowed to choose, and be visited at any reasonable time by, a legal representative.\n\ne. A court must review the detention as soon as reasonably possible, but no later than 10 days after the date the person was detained, and the court must release the detainee unless it is necessary to continue the detention to restore peace and order.\n\nf. A detainee who is not released in terms of a review under paragraph (e), or who is not released in terms of a review under this paragraph, may apply to a court for a further review of the detention at any time after 10 days have passed since the previous review, and the court must release the detainee unless it is still necessary to continue the detention to restore peace and order.\n\ng. The detainee must be allowed to appear in person before any court considering the detention, to be represented by a legal practitioner at those hearings, and to make representations against continued detention.\n\nh. The state must present written reasons to the court to justify the continued detention of the detainee, and must give a copy of those reasons to the detainee at least two days before the court reviews the detention.\n\n7. If a court releases a detainee, that person may not be detained again on the same grounds unless the state first shows a court good cause for re-detaining that person.\n\n8. Subsections (6) and (7) do not apply to persons who are not South African citizens and who are detained in consequence of an international armed conflict. Instead, the state must comply with the standards binding on the Republic under international humanitarian law in respect of the detention of such persons.\n\n38. Enforcement of rights\n\nAnyone listed in this section has the right to approach a competent court, alleging that a right in the Bill of Rights has been infringed or threatened, and the court may grant appropriate relief, including a declaration of rights. The persons who may approach a court are -\n\na. anyone acting in their own interest;\n\nb. anyone acting on behalf of another person who cannot act in their own name;\n\nc. anyone acting as a member of, or in the interest of, a group or class of persons;\n\nd. anyone acting in the public interest; and\n\ne. an association acting in the interest of its members.\n\n39. Interpretation of Bill of Rights\n\n1. When interpreting the Bill of Rights, a court, tribunal or forum ­\n\na. must promote the values that underlie an open and democratic society based on human dignity, equality and freedom;\n\nb. must consider international law; and\n\nc. may consider foreign law.\n\n2. When interpreting any legislation, and when developing the common law or customary law, every court, tribunal or forum must promote the spirit, purport and objects of the Bill of Rights.\n\n3. The Bill of Rights does not deny the existence of any other rights or freedoms that are recognised or conferred by common law, customary law or legislation, to the extent that they are consistent with the Bill.\n\n\n\n- Translation in all official languages",
  "https://www.gov.za/documents/constitution/constitution-republic-south-africa-1996-chapter-3-co-operative-government-07": "Government of the Republic\n\nPrinciples of Co-operative Government and Intergovernmental Relations\n\n40. Government of the Republic\n\n1. In the Republic, government is constituted as national, provincial and local spheres of government which are distinctive, interdependent and interrelated.\n\n2. All spheres of government must observe and adhere to the principles in this Chapter and must conduct their activities within the parameters that the Chapter provides.\n\n41. Principles of co-operative government and intergovernmental relations\n\n1. All spheres of government and all organs of state within each sphere must ­\n\na. preserve the peace, national unity and the indivisibility of the Republic;\n\nb. secure the well-being of the people of the Republic;\n\nc. provide effective, transparent, accountable and coherent government for the Republic as a whole;\n\nd. be loyal to the Constitution, the Republic and its people;\n\ne. respect the constitutional status, institutions, powers and functions of government in the other spheres;\n\nf. not assume any power or function except those conferred on them in terms of the Constitution;\n\ng. exercise their powers and perform their functions in a manner that does not encroach on the geographical, functional or institutional integrity of government in another sphere; and\n\nh. co-operate with one another in mutual trust and good faith by ­\n\ni. fostering friendly relations;\n\nii. assisting and supporting one another;\n\niii. informing one another of, and consulting one another on, matters of common interest;\n\niv. co-ordinating their actions and legislation with one another;\n\nv. adhering to agreed procedures; and\n\nvi. avoiding legal proceedings against one another.\n\n2. An Act of Parliament must ­\n\na. establish or provide for structures and institutions to promote and facilitate intergovernmental relations; and\n\nb. provide for appropriate mechanisms and procedures to facilitate settlement of intergovernmental disputes.\n\n3. An organ of state involved in an intergovernmental dispute must make every reasonable effort to settle the dispute by means of mechanisms and procedures provided for that purpose, and must exhaust all other remedies before it approaches a court to resolve the dispute.\n\n4. If a court is not satisfied that the requirements of subsection (3) have been met, it may refer a dispute back to the organs of state involved.\n\n\n\n- Translation in all official languages",
  "https://www.gov.za/documents/constitution/constitution-republic-south-africa-1996-chapter-4-parliament-07-feb-1997": "The text below includes all amendments , up to and including the 17th Amendment to the Constitution (disclaimer).\n\nSections\n\n42. Composition of Parliament 43. Legislative authority of the Republic 44. National legislative authority 45. Joint rules and orders and joint committees\n\n46. Composition and Election 47. Membership 48. Oath or Affirmation 49. Duration of National Assembly 50. Dissolution of National Assembly before expiry of its term 51. Sittings and Recess Periods 52. Speaker and Deputy Speaker 53. Decisions 54. Rights of Certain Cabinet Members in National Assembly 55. Powers of National Assembly 56. Evidence or Information Before National Assembly 57. Internal Arrangements, Proceedings and Procedures of National Assembly 58. Privilege 59. Public Access to and Involvement in National Assembly\n\n60. Composition of National Council 61. Allocation of Delegates 62. Permanent Delegates 63. Sittings of National Council 64. Chairperson and Deputy Chairpersons 65. Decisions 66. Participation by Members of National Executive 67. Participation by Local Government Representatives 68. Powers of National Council 69. Evidence or Information Before National Council 70. Internal Arrangements, Proceedings and Procedures of National Council 71. Privilege 72. Public Access to and Involvement in National Council\n\n73. All Bills 74. Bills Amending the Constitution 75. Ordinary Bills Not Affecting the Provinces 76. Ordinary Bills Affecting the Provinces 77. Money Bills 78. Mediation Committee 79. Assent to Bills 80. Application by Members of National Assembly to Constitutional Court 81. Publication of Acts 82. Safekeeping of Acts of Parliament\n\n1. Parliament consists of ­\n\na. the National Assembly; and\n\nb. the National Council of Provinces.\n\n2. The National Assembly and the National Council of Provinces participate in the legislative process in the manner set out in the Constitution.\n\n3. The National Assembly is elected to represent the people and to ensure government by the people under the Constitution. It does this by choosing the President, by providing a national forum for public consideration of issues, by passing legislation and by scrutinizing and overseeing executive action.\n\n4. The National Council of Provinces represents the provinces to ensure that provincial interests are taken into account in the national sphere of government. It does this mainly by participating in the national legislative process and by providing a national forum for public consideration of issues affecting the provinces.\n\n5. The President may summon Parliament to an extraordinary sitting at any time to conduct special business.\n\n6. The seat of Parliament is Cape Town, but an Act of Parliament enacted in accordance with section 76(1) and (5) may determine that the seat of Parliament is elsewhere.\n\nIn the Republic, the legislative authority ­\n\na. of the national sphere of government is vested in Parliament, as set out in section 44;\n\nb. of the provincial sphere of government is vested in the provincial legislatures, as set out in section 104; and\n\nc. of the local sphere of government is vested in the Municipal Councils, as set out in section 156.\n\n1. The national legislative authority as vested in Parliament\n\na. confers on the National Assembly the power\n\ni. to amend the Constitution;\n\nii. to pass legislation with regard to any matter, including a matter within a functional area listed in Schedule 4 , but excluding, subject to subsection (2), a matter within a functional area listed in Schedule 5 ; and\n\niii. to assign any of its legislative powers, except the power to amend the Constitution, to any legislative body in another sphere of government; and\n\nb. confers on the National Council of Provinces the power ­\n\ni. to participate in amending the Constitution in accordance with section 74;\n\nii. to pass, in accordance with section 76, legislation with regard to any matter within a functional area listed in Schedule 4 and any other matter required by the Constitution to be passed in accordance with section 76; and\n\niii. to consider, in accordance with section 75, any other legislation passed by the National Assembly.\n\n2. Parliament may intervene, by passing legislation in accordance with section 76(1), with regard to a matter falling within a functional area listed in Schedule 5 , when it is necessary ­\n\na. to maintain national security;\n\nb. to maintain economic unity;\n\nc. to maintain essential national standards;\n\nd. to establish minimum standards required for the rendering of services; or\n\ne. to prevent unreasonable action taken by a province which is prejudicial to the interests of another province or to the country as a whole.\n\n3. Legislation with regard to a matter that is reasonably necessary for, or incidental to, the effective exercise of a power concerning any matter listed in Schedule 4 is, for all purposes, legislation with regard to a matter listed in Schedule 4 .\n\n4. When exercising its legislative authority, Parliament is bound only by the Constitution, and must act in accordance with, and within the limits of, the Constitution.\n\n1. The National Assembly and the National Council of Provinces must establish a joint rules committee to make rules and orders concerning the joint business of the Assembly and Council, including rules and orders ­\n\na. to determine procedures to facilitate the legislative process, including setting a time limit for completing any step in the process;\n\nb. to establish joint committees composed of representatives from both the Assembly and the Council to consider and report on Bills envisaged in sections 74 and 75 that are referred to such a committee;\n\nc. to establish a joint committee to review the Constitution at least annually; and\n\nd. to regulate the business of ­\n\ni. the joint rules committee;\n\nii. the Mediation Committee;\n\niii. the constitutional review committee; and\n\niv. any joint committees established in terms of paragraph (b).\n\n2. Cabinet members, members of the National Assembly and delegates to the National Council of Provinces have the same privileges and immunities before a joint committee of the Assembly and the Council as they have before the Assembly or the Council.\n\nThe National Assembly\n\n1. The National Assembly consists of no fewer than 350 and no more than 400 women and men elected as members in terms of an electoral system that -\n\na. is prescribed by national legislation;\n\nb. is based on the national common voters roll;\n\nc. provides for a minimum voting age of 18 years; and\n\nd. results, in general, in proportional representation.\n\n[Sub-s (1) amended by s. 1 of Act No. 2 of 2003; and amended by s. 1 of the Constitution Fifteenth Amendment Act of 2009.]\n\n2. An Act of Parliament must provide a formula for determining the number of members of the National Assembly.\n\n1. Every citizen who is qualified to vote for the National Assembly is eligible to be a member of the Assembly, except ­\n\na. anyone who is appointed by, or is in the service of, the state and receives remuneration for that appointment or service, other than ­\n\ni. the President, Deputy President, Ministers and Deputy Ministers; and\n\nii. other office-bearers whose functions are compatible with the functions of a member of the Assembly, and have been declared compatible with those functions by national legislation;\n\nb. permanent delegates to the National Council of Provinces or members of a provincial legislature or a Municipal Council;\n\nc.unrehabilitated insolvents;\n\nd. anyone declared to be of unsound mind by a court of the Republic; or\n\ne. anyone who, after this section took effect, is convicted of an offence and sentenced to more than 12 months imprisonment without the option of a fine, either in the Republic, or outside the Republic if the conduct constituting the offence would have been an offence in the Republic, but no one may be regarded as having been sentenced until an appeal against the conviction or sentence has been determined, or until the time for an appeal has expired. A disqualification under this paragraph ends five years after the sentence has been completed.\n\n2. A person who is not eligible to be a member of the National Assembly in terms of subsection (1)(a) or (b) may be a candidate for the Assembly, subject to any limits or conditions established by national legislation.\n\n3. A person loses membership of the National Assembly if that person ­\n\na. ceases to be eligible;\n\nb. is absent from the Assembly without permission in circumstances for which the rules and orders of the Assembly prescribe loss of membership; or\n\nc. ceases to be a member of the party that nominated that person as a member of the Assembly.\n\n[Sub-s. (3) substituted by s. 2. of Act No. 2 of 2003; and amended by s. 2 of the Constitution Fifteenth Amendment Act of 2009.]\n\n4. Vacancies in the National Assembly must be filled in terms of national legislation.\n\nBefore members of the National Assembly begin to perform their functions in the Assembly, they must swear or affirm faithfulness to the Republic and obedience to the Constitution, in accordance with Schedule 2 .\n\n1. The National Assembly is elected for a term of five years.\n\n2. If the National Assembly is dissolved in terms of section 50, or when its term expires, the President, by proclamation must call and set dates for an election, which must be held within 90 days of the date the Assembly was dissolved or its term expired. A proclamation calling and setting dates for an election may be issued before or after the expiry of the term of the National Assembly.\n\n[Sub-s. (2) substituted by s. 1 of Act No. 2 of 1999.]\n\n3. If the result of an election of the National Assembly is not declared within the period established in terms of section 190, or if an election is set aside by a court, the President, by proclamation, must call and set dates for another election, which must be held within 90 days of the expiry of that period or of the date on which the election was set aside.\n\n4. The National Assembly remains competent to function from the time it is dissolved or its term expires, until the day before the first day of polling for the next Assembly.\n\n1. The President must dissolve the National Assembly if ­\n\na. the Assembly has adopted a resolution to dissolve with a supporting vote of a majority of its members; and\n\nb. three years have passed since the Assembly was elected.\n\n2. The Acting President must dissolve the National Assembly if ­\n\na. there is a vacancy in the office of President; and\n\nb. the Assembly fails to elect a new President within 30 days after the vacancy occurred.\n\n1. After an election, the first sitting of the National Assembly must take place at a time and on a date determined by the Chief Justice, but not more than 14 days after the election result has been declared. The Assembly may determine the time and duration of its other sittings and its recess periods.\n\n[Sub-s. (1) substituted by s.1 of Act No. 34 of 2001.]\n\n2. The President may summon the National Assembly to an extraordinary sitting at any time to conduct special business.\n\n3. Sittings of the National Assembly are permitted at places other than the seat of Parliament only on the grounds of public interest, security or convenience, and if provided for in the rules and orders of the Assembly.\n\n1. At the first sitting after its election, or when necessary to fill a vacancy, the National Assembly must elect a Speaker and a Deputy Speaker from among its members.\n\n2. The Chief Justice must preside over the election of a Speaker, or designate another judge to do so. The Speaker presides over the election of a Deputy Speaker.\n\n[Sub-s. (2) substituted by s.2 of Act No. 34 of 2001.]\n\n3. The procedure set out in Part A of Schedule 3 applies to the election of the Speaker and the Deputy Speaker.\n\n4. The National Assembly may remove the Speaker or Deputy Speaker from office by resolution. A majority of the members of the Assembly must be present when the resolution is adopted.\n\n5. In terms of its rules and orders, the National Assembly may elect from among its members other presiding officers to assist the Speaker and the Deputy Speaker.\n\n1. Except where the Constitution provides otherwise ­\n\na. a majority of the members of the National Assembly must be present before a vote may be taken on a Bill or an amendment to a Bill;\n\nb. at least one third of the members must be present before a vote may be taken on any other question before the Assembly; and\n\nc. all questions before the Assembly are decided by a majority of the votes cast.\n\n2. The member of the National Assembly presiding at a meeting of the Assembly has no deliberative vote, but ­\n\na. must cast a deciding vote when there is an equal number of votes on each side of a question; and\n\nb. may cast a deliberative vote when a question must be decided with a supporting vote of at least two thirds of the members of the Assembly.\n\nThe President, and any member of the Cabinet or any Deputy Minister who is not a member of the National Assembly, may, subject to the rules and orders of the Assembly, attend and speak in the Assembly, but may not vote.\n\n[S. 54 substituted by s. 3 of Act No. 34 of 2001.]\n\n1. In exercising its legislative power, the National Assembly may ­\n\na. consider, pass, amend or reject any legislation before the Assembly; and\n\nb. initiate or prepare legislation, except money Bills.\n\n2. The National Assembly must provide for mechanisms ­\n\na. to ensure that all executive organs of state in the national sphere of government are accountable to it; and\n\nb. to maintain oversight of ­\n\ni. the exercise of national executive authority, including the implementation of legislation; and\n\nii. any organ of state.\n\nThe National Assembly or any of its committees may ­\n\na. summon any person to appear before it to give evidence on oath or affirmation, or to produce documents;\n\nb. require any person or institution to report to it;\n\nc. compel, in terms of national legislation or the rules and orders, any person or institution to comply with a summons or requirement in terms of paragraph (a) or (b); and\n\nd. receive petitions, representations or submissions from any interested persons or institutions.\n\n1. The National Assembly may ­\n\na. determine and control its internal arrangements, proceedings and procedures; and\n\nb. make rules and orders concerning its business, with due regard to representative and participatory democracy, accountability, transparency and public involvement.\n\n2. The rules and orders of the National Assembly must provide for ­\n\na. the establishment, composition, powers, functions, procedures and duration of its committees;\n\nb. the participation in the proceedings of the Assembly and its committees of minority parties represented in the Assembly, in a manner consistent with democracy;\n\nc. financial and administrative assistance to each party represented in the Assembly in proportion to its representation, to enable the party and its leader to perform their functions in the Assembly effectively; and\n\nd. the recognition of the leader of the largest opposition party in the Assembly as the Leader of the Opposition.\n\n1. Cabinet members, Deputy Ministers and members of the National Assembly -\n\na. have freedom of speech in the Assembly and in its committees, subject to its rules and orders; and\n\nb. are not liable to civil or criminal proceedings, arrest, imprisonment or damages for ­\n\ni. anything that they have said in, produced before or submitted to the Assembly or any of its committees; or\n\nii. anything revealed as a result of anything that they have said in, produced before or submitted to the Assembly or any of its committees.\n\n2. Other privileges and immunities of the National Assembly, Cabinet members and members of the Assembly may be prescribed by national legislation.\n\n3. Salaries, allowances and benefits payable to members of the National Assembly are a direct charge against the National Revenue Fund.\n\n[S.58 amended by s.4 of Act No. 34 of 2001.]\n\n1. The National Assembly must ­\n\na. facilitate public involvement in the legislative and other processes of the Assembly and its committees; and\n\nb. conduct its business in an open manner, and hold its sittings, and those of its committees, in public, but reasonable measures may be taken ­\n\ni. to regulate public access, including access of the media, to the Assembly and its committees; and\n\nii. to provide for the searching of any person and,where appropriate, the refusal of entry to, or the removal of, any person.\n\n2. The National Assembly may not exclude the public, including the media, from a sitting of a committee unless it is reasonable and justifiable to do so in an open and democratic society.\n\nNational Council of Provinces\n\n1. The National Council of Provinces is composed of a single delegation from each province consisting of ten delegates.\n\n2. The ten delegates are ­\n\na. four special delegates consisting of-\n\nb. the Premier of the province or, if the Premier is not available, any member of the provincial legislature designated by the Premier either generally or for any specific business before the National Council of Provinces; and\n\nc. three other special delegates; and\n\nd. six permanent delegates appointed in terms of section 61(2).\n\n3. The Premier of a province, or if the Premier is not available, a member of the province's delegation designated by the Premier, heads the delegation.\n\n1. Parties represented in a provincial legislature are entitled to delegates in the province's delegation in accordance with the formula set out in Part B of Schedule 3 .\n\n2. A provincial legislature must, within 30 days after the result of an election of that legislature is declared-\n\ni. determine, in accordance with national legislation, how many of each party's delegates are to be permanent delegates and how many are to be special delegates; and\n\nii. appoint the permanent delegates in accordance with the nominations of the parties.\n\n[Para. (b) omitted by s. 1 of the Constitution Fourteenth Amendment Act of 2008.]\n\n[Sub-s. 2 amended by s. 1 of Constitution Fourteenth Amendment Act of 2008.]\n\n3. The national legislation envisaged in subsection (2)(a) must ensure the participation of minority parties in both the permanent and special delegates' components of the delegation in a manner consistent with democracy.\n\n4. The legislature, with the concurrence of the Premier and the leaders of the parties entitled to special delegates in the province's delegation, must designate special delegates, as required from time to time, from among the members of the legislature.\n\n1. A person nominated as a permanent delegate must be eligible to be a member of the provincial legislature.\n\n2. If a person who is a member of a provincial legislature is appointed as a permanent delegate, that person ceases to be a member of the legislature.\n\n3. Permanent delegates are appointed for a term that expires-\n\na. immediately before the first sitting of the provincial legislature after its next election\n\n[Para. (b) omitted by s. 2 of the Constitution Fourteenth Amendment Act of 2008.]\n\n[Sub-s. (3) amended by s. 2 of Constitution Fourteenth Amendment Act of 2008.]\n\n4. A person ceases to be a permanent delegate if that person ­\n\na. ceases to be eligible to be a member of the provincial legislature for any reason other than being appointed as a permanent delegate;\n\nb. becomes a member of the Cabinet;\n\nc. has lost the confidence of the provincial legislature and is recalled by the party that nominated that person;\n\nd. ceases to be a member of the party that nominated that person and is recalled by that party; or\n\ne. is absent from the National Council of Provinces without permission in circumstances for which the rules and orders of the Council prescribe loss of office as a permanent delegate.\n\n5. Vacancies among the permanent delegates must be filled in terms of national legislation.\n\n6. Before permanent delegates begin to perform their functions in the National Council of Provinces, they must swear or affirm faithfulness to the Republic and obedience to the Constitution, in accordance with Schedule 2.\n\n1. The National Council of Provinces may determine the time and duration of its sittings and its recess periods.\n\n2. The President may summon the National Council of Provinces to an extraordinary sitting at any time to conduct special business.\n\n3. Sittings of the National Council of Provinces are permitted at places other than the seat of Parliament only on the grounds of public interest, security or convenience, and if provided for in the rules and orders of the Council.\n\n1. The National Council of Provinces must elect a Chairperson and two Deputy Chairpersons from among the delegates.\n\n2. The Chairperson and one of the Deputy Chairpersons are elected from among the permanent delegates for five years unless their terms as delegates expire earlier.\n\n3. The other Deputy Chairperson is elected for a term of one year, and must be succeeded by a delegate from another province, so that every province is represented in turn.\n\n4. The Chief Justice must preside over the election of the Chairperson, or designate another judge to do so. The Chairperson presides over the election of the Deputy Chairpersons.\n\n[Sub-s. (4) substituted by s. 5 of Act No. 34 of 2001.]\n\n5. The procedure set out in Part A of Schedule 3 applies to the election of the Chairperson and the Deputy Chairpersons.\n\n6. The National Council of Provinces may remove the Chairperson or a Deputy Chairperson from office.\n\n7. In terms of its rules and orders, the National Council of Provinces may elect from among the delegates other presiding officers to assist the Chairperson and Deputy Chairpersons.\n\n1. Except where the Constitution provides otherwise ­\n\na. each province has one vote, which is cast on behalf of the province by the head of its delegation; and\n\nb. all questions before the National Council of Provinces are agreed when at least five provinces vote in favour of the question.\n\n2. An Act of Parliament, enacted in accordance with the procedure established by either subsection (1) or subsection (2) of section 76, must provide for a uniform procedure in terms of which provincial legislatures confer authority on their delegations to cast votes on their behalf.\n\n1. Cabinet members and Deputy Ministers may attend, and may speak in, the National Council of Provinces, but may not vote.\n\n2. The National Council of Provinces may require a Cabinet member, a Deputy Minister or an official in the national executive or a provincial executive to attend a meeting of the Council or a committee of the Council.\n\nNot more than ten part-time representatives designated by organised local government in terms of section 163, to represent the different categories of municipalities, may participate when necessary in the proceedings of the National Council of Provinces, but may not vote.\n\nIn exercising its legislative power, the National Council of Provinces may ­\n\na. consider, pass, amend, propose amendments to or reject any legislation before the Council, in accordance with this Chapter; and\n\nb. initiate or prepare legislation falling within a functional area listed in Schedule 4 or other legislation referred to in section 76(3), but may not initiate or prepare money Bills.\n\nThe National Council of Provinces or any of its committees may ­\n\na. summon any person to appear before it to give evidence on oath or affirmation or to produce documents;\n\nb. require any institution or person to report to it;\n\nc. compel, in terms of national legislation or the rules and orders, any person or institution to comply with a summons or requirement in terms of paragraph (a) or (b); and\n\nd. receive petitions, representations or submissions from any interested persons or institutions.\n\n1. The National Council of Provinces may ­\n\na. determine and control its internal arrangements, proceedings and procedures; and\n\nb. make rules and orders concerning its business, with due regard to representative and participatory democracy, accountability, transparency and public involvement.\n\n2. The rules and orders of the National Council of Provinces must provide for ­\n\na. the establishment, composition, powers, functions, procedures and duration of its committees;\n\nb. the participation of all the provinces in its proceedings in a manner consistent with democracy; and\n\nc. the participation in the proceedings of the Council and its committees of minority parties represented in the Council, in a manner consistent with democracy, whenever a matter is to be decided in accordance with section 75.\n\n1. Delegates to the National Council of Provinces and the persons referred to in sections 66 and 67 ­\n\na. have freedom of speech in the Council and in its committees, subject to its rules and orders; and\n\nb. are not liable to civil or criminal proceedings, arrest, imprisonment or damages for ­\n\ni. anything that they have said in, produced before or submitted to the Council or any of its committees; or\n\nii. anything revealed as a result of anything that they have said in, produced before or submitted to the Council or any of its committees.\n\n2. Other privileges and immunities of the National Council of Provinces, delegates to the Council and persons referred to in sections 66 and 67 may be prescribed by national legislation.\n\n3. Salaries, allowances and benefits payable to permanent members of the National Council of Provinces are a direct charge against the National Revenue Fund.\n\n1. The National Council of Provinces must ­\n\na. facilitate public involvement in the legislative and other processes of the Council and its committees; and\n\nb. conduct its business in an open manner, and hold its sittings, and those of its committees, in public, but reasonable measures may be taken ­\n\ni. to regulate public access, including access of the media, to the Council and its committees; and\n\nii. to provide for the searching of any person and, where appropriate, the refusal of entry to, or the removal of, any person.\n\n2. The National Council of Provinces may not exclude the public, including the media, from a sitting of a committee unless it is reasonable and justifiable to do so in an open and democratic society.\n\nNational Legislative Process\n\n1. Any Bill may be introduced in the National Assembly.\n\n2. Only a Cabinet member or a Deputy Minister, or a member or committee of the National Assembly, may introduce a Bill in the Assembly; but only the Cabinet member responsible for national financial matters may introduce the following Bills in the Assembly:\n\na. a Money Bill; or\n\nb. a Bill which provides for legislation envisaged in section 214.\n\n[Sub-s. (2) substituted by s. 1 (a) of Act No. 61 of 2001.]\n\n3. A Bill referred to in section 76 (3), except a Bill referred to in subsection (2) (a) or (b) of this section, may be introduced in the National Council of Provinces.\n\n[Sub-s. (3) substituted by s. 1 (b) of Act No. 61 of 2001.]\n\n4. Only a member or committee of the National Council of Provinces may introduce a Bill in the Council.\n\n5. A Bill passed by the National Assembly must be referred to the National Council of Provinces if it must be considered by the Council. A Bill passed by the Council must be referred to the Assembly.\n\n1. Section 1 and this subsection may be amended by a Bill passed by -\n\na. the National Assembly, with a supporting vote of at least 75 per cent of its members; and\n\nb. the National Council of Provinces, with a supporting vote of at least six provinces.\n\n2. Chapter 2 may be amended by a Bill passed by ­\n\na. the National Assembly, with a supporting vote of at least two thirds of its members; and\n\nb. the National Council of Provinces, with a supporting vote of at least six provinces.\n\n3. Any other provision of the Constitution may be amended by a Bill passed ­\n\na. by the National Assembly, with a supporting vote of at least two thirds of its members; and\n\nb. also by the National Council of Provinces, with a supporting vote of at least six provinces, if the amendment ­\n\ni. relates to a matter that affects the Council;\n\nii. alters provincial boundaries, powers, functions or institutions; or\n\niii. amends a provision that deals specifically with a provincial matter.\n\n4. A Bill amending the Constitution may not include provisions other than constitutional amendments and matters connected with the amendments.\n\n5. At least 30 days before a Bill amending the Constitution is introduced in terms of section 73(2), the person or committee intending to introduce the Bill must ­\n\na. publish in the national Government Gazette , and in accordance with the rules and orders of the National Assembly, particulars of the proposed amendment for public comment;\n\nb. submit, in accordance with the rules and orders of the Assembly, those particulars to the provincial legislatures for their views; and\n\nc. submit, in accordance with the rules and orders of the National Council of Provinces, those particulars to the Council for a public debate, if the proposed amendment is not an amendment that is required to be passed by the Council.\n\n6. When a Bill amending the Constitution is introduced, the person or committee introducing the Bill must submit any written comments received from the public and the provincial legislatures ­\n\na. to the Speaker for tabling in the National Assembly; and\n\nb. in respect of amendments referred to in subsection (1), (2) or (3)(b), to the Chairperson of the National Council of Provinces for tabling in the Council.\n\n7. A Bill amending the Constitution may not be put to the vote in the National Assembly within 30 days of ­\n\na. its introduction, if the Assembly is sitting when the Bill is introduced; or\n\nb. its tabling in the Assembly, if the Assembly is in recess when the Bill is introduced.\n\n8. If a Bill referred to in subsection (3)(b), or any part of the Bill, concerns only a specific province or provinces, the National Council of Provinces may not pass the Bill or the relevant part unless it has been approved by the legislature or legislatures of the province or provinces concerned.\n\n9. A Bill amending the Constitution that has been passed by the National Assembly and, where applicable, by the National Council of Provinces, must be referred to the President for assent.\n\n1. When the National Assembly passes a Bill other than a Bill to which the procedure set out in section 74 or 76 applies, the Bill must be referred to the National Council of Provinces and dealt with in accordance with the following procedure:\n\na. The Council must ­\n\ni. pass the Bill;\n\nii. pass the Bill subject to amendments proposed by it; or\n\niii. reject the Bill.\n\nb. If the Council psses the Bill without proposing amendments, the Bill must be submitted to the President for assent.\n\nc. If the Council rejects the Bill or passes it subject to amendments, the Assembly must reconsider the Bill, taking into account any amendment proposed by the Council, and may ­\n\ni. pass the Bill again, either with or without amendments; or\n\nii. decide not to proceed with the Bill.\n\nd. A Bill passed by the Assembly in terms of paragraph (c) must be submitted to the President for assent.\n\n2. When the National Council of Provinces votes on a question in terms of this section, section 65 does not apply; instead ­\n\na. each delegate in a provincial delegation has one vote;\n\nb. at least one third of the delegates must be present before a vote may be taken on the question; and\n\nc. the question is decided by a majority of the votes cast, but if there is an equal number of votes on each side of the question, the delegate presiding must cast a deciding vote.\n\n1. When the National Assembly passes a Bill referred to in subsection (3), (4) or (5), the Bill must be referred to the National Council of Provinces and dealt with in accordance with the following procedure:\n\na. The Council must ­\n\ni. pass the Bill;\n\nii. pass an amended Bill; or\n\niii. reject the Bill.\n\nb. If the Council passes the Bill without amendment, the Bill must be submitted to the President for assent.\n\nc. If the Council passes an amended Bill, the amended Bill must be referred to the Assembly, and if the Assembly passes the amended Bill, it must be submitted to the President for assent.\n\nd. If the Council rejects the Bill, or if the Assembly refuses to pass an amended Bill referred to it in terms of paragraph (c), the Bill and, where applicable, also the amended Bill, must be referred to the Mediation Committee, which may agree on ­\n\ni. the Bill as passed by the Assembly;\n\nii. the amended Bill as passed by the Council; or\n\niii. another version of the Bill.\n\ne. If the Mediation Committee is unable to agree within 30 days of the Bill's referral to it, the Bill lapses unless the Assembly again passes the Bill, but with a supporting vote of at least two thirds of its members.\n\nf. If the Mediation Committee agrees on the Bill as passed by the Assembly, the Bill must be referred to the Council, and if the Council passes the Bill, the Bill must be submitted to the President for assent.\n\ng. If the Mediation Committee agrees on the amended Bill as passed by the Council, the Bill must be referred to the Assembly, and if it is passed by the Assembly, it must be submitted to the President for assent.\n\nh. If the Mediation Committee agrees on another version of the Bill, that version of the Bill must be referred to both the Assembly and the Council, and if it is passed by the Assembly and the Council, it must be submitted to the President for assent.\n\ni. If a Bill referred to the Council in terms of paragraph (f) or (h) is not passed by the Council, the Bill lapses unless the Assembly passes the Bill with a supporting vote of at least two thirds of its members.\n\nj. If a Bill referred to the Assembly in terms of paragraph (g) or (h) is not passed by the Assembly, that Bill lapses, but the Bill as originally passed by the Assembly may again be passed by the Assembly, but with a supporting vote of at least two thirds of its members.\n\nk. A Bill passed by the Assembly in terms of paragraph (e), (i) or (j) must be submitted to the President for assent.\n\n2. When the National Council of Provinces passes a Bill referred to in subsection (3), the Bill must be referred to the National Assembly and dealt with in accordance with the following procedure:\n\na. The Assembly must ­\n\ni. pass the Bill;\n\nii. pass an amended Bill; or\n\niii. reject the Bill.\n\nb. A Bill passed by the Assembly in terms of paragraph (a)(i) must be submitted to the President for assent.\n\nc. If the Assembly passes an amended Bill, the amended Bill must be referred to the Council, and if the Council passes the amended Bill, it must be submitted to the President for assent.\n\nd. If the Assembly rejects the Bill, or if the Council refuses to pass an amended Bill referred to it in terms of paragraph (c), the Bill and, where applicable, also the amended Bill must be referred to the Mediation Committee, which may agree on ­\n\ni. the Bill as passed by the Council;\n\nii. the amended Bill as passed by the Assembly; or\n\niii. another version of the Bill.\n\ne. If the Mediation Committee is unable to agree within 30 days of the Bill's referral to it, the Bill lapses.\n\nf. If the Mediation Committee agrees on the Bill as passed by the Council, the Bill must be referred to the Assembly, and if the Assembly passes the Bill, the Bill must be submitted to the President for assent.\n\ng. If the Mediation Committee agrees on the amended Bill as passed by the Assembly, the Bill must be referred to the Council, and if it is passed by the Council, it must be submitted to the President for assent.\n\nh. If the Mediation Committee agrees on another version of the Bill, that version of the Bill must be referred to both the Council and the Assembly, and if it is passed by the Council and the Assembly, it must be submitted to the President for assent.\n\ni. If a Bill referred to the Assembly in terms of paragraph (f) or (h) is not passed by the Assembly, the Bill lapses.\n\n3. A Bill must be dealt with in accordance with the procedure established by either subsection (1) or subsection (2) if it falls within a functional area listed in Schedule 4 or provides for legislation envisaged in any of the following sections:\n\na. Section 65(2);\n\nb. section 163;\n\nc. section 182;\n\nd. section 195(3) and (4);\n\ne. section 196; and\n\nf. section 197.\n\n4. A Bill must be dealt with in accordance with the procedure established by subsection (1) if it provides for legislation ­\n\na. envisaged in section 44(2) or 220(3); or\n\nb. envisaged in Chapter 13, and which includes any provision affecting the financial interests of the provincial sphere of government.\n\n[Para. (b) substituted by s. 1 of Act No. 3 of 2003.]\n\n5. A Bill envisaged in section 42(6) must be dealt with in accordance with the procedure established by subsection (1), except that ­\n\na. when the National Assembly votes on the Bill, the provisions of section 53(1) do not apply; instead, the Bill may be passed only if a majority of the members of the Assembly vote in favour of it; and\n\nb. if the Bill is referred to the Mediation Committee, the following rules apply:\n\ni. If the National Assembly considers a Bill envisaged in subsection (1) (g) or (h), that Bill may be passed only if a majority of the members of the Assembly vote in favour of it.\n\nii. If the National Assembly considers or reconsiders a Bill envisaged in subsection (1)(e), (i) or (j), that Bill may be passed only if at least two thirds of the members of the Assembly vote in favour of it.\n\n6. This section does not apply to money Bills.\n\n1. A Bill is a money Bill if it -\n\na. appropriates money;\n\nb. imposes national taxes, levies, duties or surcharges;\n\nc. abolishes or reduces, or grants exemptions from, any national taxes, levies, duties or surcharges; or\n\nd. authorises direct charges against the National Revenue Fund, except a Bill envisaged in section 214 authorising direct charges.\n\n2. A money Bill may not deal with any other matter except -\n\na. a subordinate matter incidental to the appropriation of money;\n\nb. the imposition, abolition or reduction of national taxes, levies, duties or surcharges;\n\nc. the granting of exemption from national taxes, levies, duties or surcharges; or\n\nd. the authorisation of direct charges against the National Revenue Fund.\n\n3. All money Bills must be considered in accordance with the procedure established by section 75. An Act of Parliament must provide for a procedure to amend money Bills before Parliament.\n\n[S. 77 substituted by s. 2 of Act No. 61 of 2001.]\n\n1. The Mediation Committee consists of ­\n\na. nine members of the National Assembly elected by the Assembly in accordance with a procedure that is prescribed by the rules and orders of the Assembly and results in the representation of parties in substantially the same proportion that the parties are represented in the Assembly; and\n\nb. one delegate from each provincial delegation in the National Council of Provinces, designated by the delegation.\n\n2. The Mediation Committee has agreed on a version of a Bill, or decided a question, when that version, or one side of the question, is supported by ­\n\na. at least five of the representatives of the National Assembly; and\n\nb. at least five of the representatives of the National Council of Provinces.\n\n1. The President must either assent to and sign a Bill passed in terms of this Chapter or, if the President has reservations about the constitutionality of the Bill, refer it back to the National Assembly for reconsideration.\n\n2. The joint rules and orders must provide for the procedure for the reconsideration of a Bill by the National Assembly and the participation of the National Council of Provinces in the process.\n\n3. The National Council of Provinces must participate in the reconsideration of a Bill that the President has referred back to the National Assembly if ­\n\na. the President's reservations about the constitutionality of the Bill relate to a procedural matter that involves the Council; or\n\nb. section 74(1), (2) or (3)(b) or 76 was applicable in the passing of the Bill.\n\n4. If, after reconsideration, a Bill fully accommodates the President's reservations, the President must assent to and sign the Bill; if not, the President must either ­\n\na. assent to and sign the Bill; or\n\nb. refer it to the Constitutional Court for a decision on its constitutionality.\n\n5. If the Constitutional Court decides that the Bill is constitutional, the President must assent to and sign it.\n\n1. Members of the National Assembly may apply to the Constitutional Court for an order declaring that all or part of an Act of Parliament is unconstitutional.\n\n2. An application ­\n\na. must be supported by at least one third of the members of the National Assembly; and\n\nb. must be made within 30 days of the date on which the President assented to and signed the Act.\n\n3. The Constitutional Court may order that all or part of an Act that is the subject of an application in terms of subsection (1) has no force until the Court has decided the application if ­\n\na. the interests of justice require this; and\n\nb. the application has a reasonable prospect of success.\n\n4. If an application is unsuccessful, and did not have a reasonable prospect of success, the Constitutional Court may order the applicants to pay costs.\n\nA Bill assented to and signed by the President becomes an Act of Parliament, must be published promptly, and takes effect when published or on a date determined in terms of the Act.\n\nThe signed copy of an Act of Parliament is conclusive evidence of the provisions of that Act and, after publication, must be entrusted to the Constitutional Court for safekeeping.\n\n\n\n- Translation in all official languages",
  "https://www.gov.za/documents/constitution/constitution-republic-south-africa-1996-chapter-5-president-and-national": "The text below includes all amendments , up to and including the 17th Amendment to the Constitution ( disclaimer ).\n\nSections\n\nThe President\n\nPowers and functions of President\n\nExecutive authority of the Republic\n\nElection of President\n\nAssumption of office by President\n\nTerm of office of President\n\nRemoval of President\n\nActing President\n\nCabinet\n\nAccountability and responsibilities\n\nDeputy Ministers\n\nContinuation of Cabinet after elections\n\nOath or affirmation\n\nConduct of Cabinet members and Deputy Ministers\n\nTransfer of functions\n\nTemporary assignment of functions\n\nAssignment of functions\n\nNational intervention in provincial administration\n\nExecutive decisions\n\nMotions of no confidence\n\nThe President ­\n\na. is the Head of State and head of the national executive;\n\nb. must uphold, defend and respect the Constitution as the supreme law of the Republic; and\n\nc. promotes the unity of the nation and that which will advance the Republic.\n\n1. The President has the powers entrusted by the Constitution and legislation, including those necessary to perform the functions of Head of State and head of the national executive.\n\n2. The President is responsible for ­\n\na. assenting to and signing Bills;\n\nb. referring a Bill back to the National Assembly for reconsideration of the Bill's constitutionality;\n\nc. referring a Bill to the Constitutional Court for a decision on the Bill's constitutionality;\n\nd. summoning the National Assembly, the National Council of Provinces or Parliament to an extraordinary sitting to conduct special business;\n\ne. making any appointments that the Constitution or legislation requires the President to make, other than as head of the national executive;\n\nf. appointing commissions of inquiry;\n\ng. calling a national referendum in terms of an Act of Parliament;\n\nh. receiving and recognising foreign diplomatic and consular representatives;\n\ni. appointing ambassadors, plenipotentiaries, and diplomatic and consular representatives;\n\nj. pardoning or reprieving offenders and remitting any fines, penalties or forfeitures; and\n\nk. conferring honours.\n\n[General Note: Honourable tributes instituted in Government Gazette 24155 of 6 December, 2002, Government Gazette 25213 of 25 July, 2003 and Government Gazette 25799 of 2 December, 2003.]\n\n1. The executive authority of the Republic is vested in the President.\n\n2. The President exercises the executive authority, together with the other members of the Cabinet, by ­\n\na. implementing national legislation except where the Constitution or an Act of Parliament provides otherwise;\n\nb. developing and implementing national policy;\n\nc. co-ordinating the functions of state departments and administrations;\n\nd. preparing and initiating legislation; and\n\ne. performing any other executive function provided for in the Constitution or in national legislation.\n\nAt its first sitting after its election, and whenever necessary to fill a vacancy, the National Assembly must elect a woman or a man from among its members to be the President.\n\nAt its first sitting after its election, and whenever necessary to fill a vacancy, the National Assembly must elect a woman or a man from among its members to be the President.\n\nThe Chief Justice must preside over the election of the President, or designate another judge to do so. The procedure set out in Part A of Schedule 3 applies to the election of the President.\n\nThe Chief Justice must preside over the election of the President, or designate another judge to do so. The procedure set out in Part A of Schedule 3 applies to the election of the President.\n\n[Sub-s. (2) substituted by s. 6 of Act No. 34 of 2001.]\n\nAn election to fill a vacancy in the office of President must be held at a time and on a date determined by the Chief Justice, but not more than 30 days after the vacancy occurs.\n\nAn election to fill a vacancy in the office of President must be held at a time and on a date determined by the Chief Justice, but not more than 30 days after the vacancy occurs.\n\n[Sub-s. (3) substituted by s. 6 of Act No. 34 of 2001.]\n\nWhen elected President, a person ceases to be a member of the National Assembly and, within five days, must assume office by swearing or affirming faithfulness to the Republic and obedience to the Constitution, in accordance with Schedule 2.\n\n1. The President's term of office begins on assuming office and ends upon a vacancy occurring or when the person next elected President assumes office.\n\n2. No person may hold office as President for more than two terms, but when a person is elected to fill a vacancy in the office of President, the period between that election and the next election of a President is not regarded as a term.\n\n1. The National Assembly, by a resolution adopted with a supporting vote of at least two thirds of its members, may remove the President from office only on the grounds of ­\n\na. a serious violation of the Constitution or the law;\n\nb. serious misconduct; or\n\nc. inability to perform the functions of office.\n\n2. Anyone who has been removed from the office of President in terms of subsection (1) (a) or (b) may not receive any benefits of that office, and may not serve in any public office.\n\n1. When the President is absent from the Republic or otherwise unable to fulfil the duties of President, or during a vacancy in the office of President, an office-bearer in the order below acts as President:\n\na. The Deputy President.\n\nb. A Minister designated by the President.\n\nc. A Minister designated by the other members of the Cabinet.\n\nd. The Speaker, until the National Assembly designates one of its other members.\n\n2. An Acting President has the responsibilities, powers and functions of the President.\n\n3. Before assuming the responsibilities, powers and functions of the President, the Acting President must swear or affirm faithfulness to the Republic and obedience to the Constitution, in accordance with Schedule 2.\n\n4. A person who as Acting President has sworn or affirmed faithfulness to the Republic need not repeat the swearing or affirming procedure for any subsequent term as Acting President during the period ending when the person next elected President assumes office.\n\n[Sub-s. (4) added by s. 1 of Act No. 35 of 1997 ]\n\n1. The Cabinet consists of the President, as head of the Cabinet, a Deputy President and Ministers.\n\n2. The President appoints the Deputy President and Ministers, assigns their powers and functions, and may dismiss them.\n\n3. The President ­\n\na. must select the Deputy President from among the members of the National Assembly;\n\nb. may select any number of Ministers from among the members of the Assembly; and\n\nc. may select no more than two Ministers from outside the Assembly.\n\n4. The President must appoint a member of the Cabinet to be the leader of government business in the National Assembly.\n\n5. The Deputy President must assist the President in the execution of the functions of government.\n\n1. The Deputy President and Ministers are responsible for the powers and functions of the executive assigned to them by the President.\n\n2. Members of the Cabinet are accountable collectively and individually to Parliament for the exercise of their powers and the performance of their functions.\n\n3. Members of the Cabinet must ­\n\na. act in accordance with the Constitution; and\n\nb. provide Parliament with full and regular reports concerning matters under their control.\n\n1. The President may appoint-\n\na. any number of Deputy Ministers from among the members of the National Assembly; and\n\nb. no more than two Deputy Ministers from outside the Assembly, to assist the members of the Cabinet, and may dismiss them.\n\n2. Deputy Ministers appointed in terms of subsection (1) (b) are accountable to Parliament for the exercise of their powers and the performance of their functions.\n\n[S. 93 substituted by s. 7 of Act No. 34 of 2001.]\n\nWhen an election of the National Assembly is held, the Cabinet, the Deputy President, Ministers and any Deputy Ministers remain competent to function until the person elected President by the next Assembly assumes office.\n\nBefore the Deputy President, Ministers and any Deputy Ministers begin to perform their functions, they must swear or affirm faithfulness to the Republic and obedience to the Constitution, in accordance with Schedule 2.\n\n1. Members of the Cabinet and Deputy Ministers must act in accordance with a code of ethics prescribed by national legislation.\n\n2. Members of the Cabinet and Deputy Ministers may not ­\n\na. undertake any other paid work;\n\nb. act in any way that is inconsistent with their office, or expose themselves to any situation involving the risk of a conflict between their official responsibilities and private interests; or\n\nc. use their position or any information entrusted to them, to enrich themselves or improperly benefit any other person.\n\nThe President by proclamation may transfer to a member of the Cabinet ­\n\na. the administration of any legislation entrusted to another member; or\n\nb. any power or function entrusted by legislation to another member.\n\nThe President may assign to a Cabinet member any power or function of another member who is absent from office or is unable to exercise that power or perform that function.\n\nA Cabinet member may assign any power or function that is to be exercised or performed in terms of an Act of Parliament to a member of a provincial Executive Council or to a Municipal Council. An assignment ­\n\na. must be in terms of an agreement between the relevant Cabinet member and the Executive Council member or Municipal Council;\n\nb. must be consistent with the Act of Parliament in terms of which the relevant power or function is exercised or performed; and\n\nc. takes effect upon proclamation by the President.\n\n[Heading amended by s. 2(a) the Constitution Eleventh Amendment Act of 2003.]\n\n1. When a province cannot or does not fulfil an executive obligation in terms of the Constitution or legislation, the national executive may intervene by taking any appropriate steps to ensure fulfilment of that obligation, including -\n\na. issuing a directive to the provincial executive, describing the extent of the failure to fulfil its obligations and stating any steps required to meet its obligations; and\n\nb. assuming responsibility for the relevant obligation in that province to the extent necessary to ­\n\ni. maintain essential national standards or meet established minimum standards for the rendering of a service;\n\nii. maintain economic unity;\n\niii. maintain national security; or\n\niv. prevent that province from taking unreasonable action that is prejudicial to the interests of another province or to the country as a whole.\n\n[Sub-s. (1) substituted by s. (2) (b) of Act No. 3 of 2003.]\n\n2. If the national executive intervenes in a province in terms of subsection (1)(b) ­\n\na. it must submit a written notice of the intervention to the National Council of Provinces within 14 days after the intervention began;\n\nb. the intervention must end if the Council disapproves the intervention within 180 days after the intervention began or by the end of that period has not approved the intervention; and\n\nc. the Council must, while the intervention continues, review the intervention regularly and make any appropriate recommendations to the national executive.\n\n[Sub-s. (2) substituted by s. (2) (c) of Act No. 3 of 2003.]\n\n3. National legislation may regulate the process established by this section.\n\n[S 100 amended by s. (2) (a) of Act No. 3 of 2003.]\n\n1. A decision by the President must be in writing if it ­\n\na. is taken in terms of legislation; or\n\nb. has legal consequences.\n\n2. A written decision by the President must be countersigned by another Cabinet member if that decision concerns a function assigned to that other Cabinet member.\n\n3. Proclamations, regulations and other instruments of subordinate legislation must be accessible to the public.\n\n4. National legislation may specify the manner in which, and the extent to which, instruments mentioned in subsection (3) must be ­\n\na. tabled in Parliament; and\n\nb. approved by Parliament.\n\n1. If the National Assembly, by a vote supported by a majority of its members, passes a motion of no confidence in the Cabinet excluding the President, the President must reconstitute the Cabinet.\n\n2. If the National Assembly, by a vote supported by a majority of its members, passes a motion of no confidence in the President, the President and the other members of the Cabinet and any Deputy Ministers must resign.\n\n\n\n- Translation in all official languages",
  "https://www.gov.za/documents/constitution/constitution-republic-south-africa-1996-chapter-6-provinces-07-feb-1997": "The text below includes all amendments , up to and including the 17th Amendment to the Constitution ( disclaimer ).\n\nSections\n\nProvinces\n\nProvincial Legis la tures\n\nLegislative authority of provinces\n\nComposition and election of provincial legislatures\n\nMembership\n\nOath or affirmation\n\nDuration of provincial legislatures\n\nDissolution of provincial legislatures before expiry of term\n\nSittings and recess periods\n\nSpeakers and Deputy Speakers\n\nDecisions\n\nPermanent delegates' rights in provincial legislatures\n\nPowers of provincial legislatures\n\nEvidence or information before provincial legislatures\n\nInternal arrangements, proceedings and procedures of provincial legislatures\n\nPrivilege\n\nPublic access to and involvement in provincial legislatures\n\nIntroduction of Bills\n\nMoney Bills\n\nAssent to Bills\n\nApplication by members to Constitutional Court\n\nPublication of provincial Acts\n\nSafekeeping of provincial Acts\n\nProvincial Executives\n\nExecutive authority of provinces\n\nAssignment of functions\n\nPowers and functions of Premiers\n\nElection of Premiers\n\nAssumption of office by Premiers\n\nTerm of office and removal of Premiers\n\nActing Premiers\n\nExecutive Councils\n\nAccountability and responsibilities\n\nContinuation of Executive Councils after elections\n\nOath or affirmation\n\nConduct of members of Executive Councils\n\nTransfer of functions\n\nTemporary assignment of functions\n\nProvincial intervention in local government\n\nExecutive decisions\n\nMotions of no confidence\n\nProvincial Constitutions\n\nAdoption of provincial constitutions\n\nContents of provincial constitutions\n\nCertification of provincial constitution\n\nSigning, publication and safekeeping of provincial constitutions\n\nConflicting Laws\n\nConflicts between national and provincial legislation\n\nOther conflicts\n\nConflicts that cannot be resolved\n\nStatus of legislation that does not prevail\n\nInterpretation of conflicts\n\n1. The Republic has the following provinces:\n\na. Eastern Cape\n\nb. Free State\n\nc. Gauteng\n\nd. KwaZulu-Natal\n\ne. Limpopo\n\nf. Mpumalanga\n\ng. Northern Cape\n\nh. North West\n\ni. Western Cape.\n\n[Sub-s. (1) substituted by s. 3 of the Constitution Eleventh Amendment Act of 2003 and substituted by s. 1 of the Constitution Twelfth Amendment Act of 2005]\n\n2. The geographical areas of the respective provinces comprise the sum of the indicated geographical areas reflected in the various maps referred to in the Notice listed in Schedule 1A.\n\n[Sub-s. (2) substituted by s. 1 of the Constitution Twelfth Amendment Act of 2005.]\n\n3.        a. Whenever the geographical area of a province is re-determined by an amendment to the Constitution, an Act of Parliament may provide for measures to regulate, within a reasonable time, the legal, practical and any other consequences of the re-determination.\n\nb. An Act of Parliament envisaged in paragraph (a) may be enacted and implemented before such amendment to the Constitution takes effect, but any provincial functions, assets, rights, obligations, duties or liabilities may only be transferred in terms of that Act after that amendment to the Constitution takes effect.\".\n\n[S. 103 substituted by s. 1 of Constitution Twelfth Amendment Act of 2005]\n\nProvincial Legislatures\n\n1. The legislative authority of a province is vested in its provincial legislature, and confers on the provincial legislature the power ­\n\na. to pass a constitution for its province or to amend any constitution passed by it in terms of sections 142 and 143;\n\nb. to pass legislation for its province with regard to ­\n\ni. any matter within a functional area listed in Schedule 4;\n\nii. any matter within a functional area listed in Schedule 5;\n\niii. any matter outside those functional areas, and that is expressly assigned to the province by national legislation; and\n\niv. any matter for which a provision of the Constitution envisages the enactment of provincial legislation; and\n\nc. to assign any of its legislative powers to a Municipal Council in that province.\n\n2. The legislature of a province, by a resolution adopted with a supporting vote of at least two thirds of its members, may request Parliament to change the name of that province.\n\n3. A provincial legislature is bound only by the Constitution and, if it has passed a constitution for its province, also by that constitution, and must act in accordance with, and within the limits of, the Constitution and that provincial constitution.\n\n4. Provincial legislation with regard to a matter that is reasonably necessary for, or incidental to, the effective exercise of a power concerning any matter listed in Schedule 4, is for all purposes legislation with regard to a matter listed in Schedule 4.\n\n5. A provincial legislature may recommend to the National Assembly legislation concerning any matter outside the authority of that legislature, or in respect of which an Act of Parliament prevails over a provincial law.\n\n1. A provincial legislature consists of women and men elected as members in terms of an electoral system that-\n\na. is prescribed by national legislation;\n\nb. is based on that province's segment of the national common voters roll;\n\nc. provides for a minimum voting age of 18 years; and\n\nd. results, in general, in proportional representation.\n\n[Sub-s. (1) amended by s. 3 of the Constitution Tenth Amendment Act of 2003 and by s. 3 of the Constitution Fourteenth Amendment Act of 2008.]\n\n2. A provincial legislature consists of between 30 and 80 members. The number of members, which may differ among the provinces, must be determined in terms of a formula prescribed by national legislation.\n\n1. Every citizen who is qualified to vote for the National Assembly is eligible to be a member of a provincial legislature, except ­\n\na. anyone who is appointed by, or is in the service of, the state and receives remuneration for that appointment or service, other than ­\n\ni. the Premier and other members of the Executive Council of a province; and\n\nii. other office-bearers whose functions are compatible with the functions of a member of a provincial legislature, and have been declared compatible with those functions by national legislation;\n\nb. members of the National Assembly, permanent delegates to the National Council of Provinces or members of a Municipal Council;\n\nc. unrehabilitated insolvents;\n\nd. anyone declared to be of unsound mind by a court of the Republic; or\n\ne. anyone who, after this section took effect, is convicted of an offence and sentenced to more than 12 months' imprisonment without the option of a fine, either in the Republic, or outside the Republic if the conduct constituting the offence would have been an offence in the Republic, but no one may be regarded as having been sentenced until an appeal against the conviction or sentence has been determined, or until the time for an appeal has expired. A disqualification under this paragraph ends five years after the sentence has been completed.\n\n2. A person who is not eligible to be a member of a provincial legislature in terms of subsection (1) (a) or (b) may be a candidate for the legislature, subject to any limits or conditions established by national legislation.\n\n3. A person loses membership of a provincial legislature if that person ­\n\na. ceases to be eligible; or\n\nb. is absent from the legislature without permission in circumstances for which the rules and orders of the legislature prescribe loss of membership; or\n\nc. Ceases to be a member of the party that nominated that person as a member of the legislature.\n\n[Sub-s. (3) substituted by s. 4 of the Constitution Tenth Amendment Act of 2003 and by s. 4 of the Constitution Fourteenth Amendment Act of 2008.]\n\n4. Vacancies in a provincial legislature must be filled in terms of national legislation.\n\nBefore members of a provincial legislature begin to perform their functions in the legislature, they must swear or affirm faithfulness to the Republic and obedience to the Constitution, in accordance with Schedule 2.\n\n1. A provincial legislature is elected for a term of five years.\n\n2. If a provincial legislature is dissolved in terms of section 109, or when its term expires, the Premier of the province, by proclamation, must call and set dates for an election, which must be held within 90 days of the date the legislature was dissolved or its term expired. A proclamation calling and setting dates for an election may be issued before or after the expiry of the term of a provincial legislature.\n\n[Sub-s. (2) substituted by s. 1 of the Constitution Fourth Amendment Act of 1999.]\n\n3. If the result of an election of a provincial legislature is not declared within the period referred to in section 190, or if an election is set aside by a court, the President, by proclamation, must call and set dates for another election, which must be held within 90 days of the expiry of that period or of the date on which the election was set aside.\n\n4. A provincial legislature remains competent to function from the time it is dissolved or its term expires, until the day before the first day of polling for the next legislature.\n\n1. The Premier of a province must dissolve the provincial legislature if ­\n\na. the legislature has adopted a resolution to dissolve with a supporting vote of a majority of its members; and\n\nb. three years have passed since the legislature was elected.\n\n2. An Acting Premier must dissolve the provincial legislature if ­\n\na. there is a vacancy in the office of Premier; and\n\nb. the legislature fails to elect a new Premier within 30 days after the vacancy occurred.\n\n1. After an election, the first sitting of a provincial legislature must take place at a time and on a date determined by a judge designated by the Chief Justice, but not more than 14 days after the election result has been declared. A provincial legislature may determine the time and duration of its other sittings and its recess periods.\n\n[Sub-s. (1) substituted by s. 8 of the Constitution Sixth Amendment Act of 2001.]\n\n2. The Premier of a province may summon the provincial legislature to an extraordinary sitting at any time to conduct special business.\n\n3. A provincial legislature may determine where it ordinarily will sit.\n\n1. At the first sitting after its election, or when necessary to fill a vacancy, a provincial legislature must elect a Speaker and a Deputy Speaker from among its members.\n\n2. A judge designated by the Chief Justice must preside over the election of a Speaker. The Speaker presides over the election of a Deputy Speaker.\n\n[Sub-s. (2) substituted by s. 9 of the Constitution Sixth Amendment Act of 2001.]\n\n3. The procedure set out in Part A of Schedule 3 applies to the election of Speakers and Deputy Speakers.\n\n4. A provincial legislature may remove its Speaker or Deputy Speaker from office by resolution. A majority of the members of the legislature must be present when the resolution is adopted.\n\n5. In terms of its rules and orders, a provincial legislature may elect from among its members other presiding officers to assist the Speaker and the Deputy Speaker.\n\n1. Except where the Constitution provides otherwise ­\n\na. a majority of the members of a provincial legislature must be present before a vote may be taken on a Bill or an amendment to a Bill;\n\nb. at least one third of the members must be present before a vote may be taken on any other question before the legislature; and\n\nc. all questions before a provincial legislature are decided by a majority of the votes cast.\n\n2. The member presiding at a meeting of a provincial legislature has no deliberative vote, but ­\n\na. must cast a deciding vote when there is an equal number of votes on each side of a question; and\n\nb. may cast a deliberative vote when a question must be decided with a supporting vote of at least two thirds of the members of the legislature.\n\nA province's permanent delegates to the National Council of Provinces may attend, and may speak in, their provincial legislature and its committees, but may not vote. The legislature may require a permanent delegate to attend the legislature or its committees.\n\n1. In exercising its legislative power, a provincial legislature may ­\n\na. consider, pass, amend or reject any Bill before the legislature; and\n\nb. initiate or prepare legislation, except money Bills.\n\n2. A provincial legislature must provide for mechanisms ­\n\na. to ensure that all provincial executive organs of state in the province are accountable to it; and\n\nb. to maintain oversight of ­\n\ni. the exercise of provincial executive authority in the province, including the implementation of legislation; and\n\nii. any provincial organ of state.\n\nA provincial legislature or any of its committees may ­\n\na. summon any person to appear before it to give evidence on oath or affirmation, or to produce documents;\n\nb. require any person or provincial institution to report to it;\n\nc. compel, in terms of provincial legislation or the rules and orders, any person or institution to comply with a summons or requirement in terms of paragraph (a) or (b); and\n\nd. receive petitions, representations or submissions from any interested persons or institutions.\n\n1. A provincial legislature may ­\n\na. determine and control its internal arrangements, proceedings and procedures; and\n\nb. make rules and orders concerning its business, with due regard to representative and participatory democracy, accountability, transparency and public involvement.\n\n2. The rules and orders of a provincial legislature must provide for ­\n\na. the establishment, composition, powers, functions, procedures and duration of its committees;\n\nb. the participation in the proceedings of the legislature and its committees of minority parties represented in the legislature, in a manner consistent with democracy;\n\nc. financial and administrative assistance to each party represented in the legislature, in proportion to its representation, to enable the party and its leader to perform their functions in the legislature effectively; and\n\nd. the recognition of the leader of the largest opposition party in the legislature, as the Leader of the Opposition.\n\n1. Members of a provincial legislature and the province's permanent delegates to the National Council of Provinces ­\n\na. have freedom of speech in the legislature and in its committees, subject to its rules and orders; and\n\nb. are not liable to civil or criminal proceedings, arrest, imprisonment or damages for ­\n\ni. anything that they have said in, produced before or submitted to the legislature or any of its committees; or\n\nii. anything revealed as a result of anything that they have said in, produced before or submitted to the legislature or any of its committees.\n\n2. Other privileges and immunities of a provincial legislature and its members may be prescribed by national legislation.\n\n3. Salaries, allowances and benefits payable to members of a provincial legislature are a direct charge against the Provincial Revenue Fund.\n\n1. A provincial legislature must ­\n\na. facilitate public involvement in the legislative and other processes of the legislature and its committees; and\n\nb. conduct its business in an open manner, and hold its sittings, and those of its committees, in public, but reasonable measures may be taken ­\n\ni. to regulate public access, including access of the media, to the legislature and its committees; and\n\nii. to provide for the searching of any person and, where appropriate, the refusal of entry to,or the removal of, any person.\n\n2. A provincial legislature may not exclude the public, including the media, from a sitting of a committee unless it is reasonable and justifiable to do so in an open and democratic society.\n\nOnly members of the Executive Council of a province or a committee or member of a provincial legislature may introduce a Bill in the legislature; but only the member of the Executive Council who is responsible for financial matters in the province may introduce a money Bill in the legislature.\n\n1. A Bill is a money Bill if it-\n\na. appropriates money;\n\nb. imposes provincial taxes, levies, duties or surcharges;\n\nc. abolishes or reduces, or grants exemptions from, any provincial taxes, levies, duties or surcharges; or\n\nd. authorises direct charges against a Provincial Revenue Fund.\n\n2. A money Bill may not deal with any other matter except-\n\na. a subordinate matter incidental to the appropriation of money;\n\nb. the imposition, abolition or reduction of provincial taxes, levies, duties or surcharges;\n\nc. the granting of exemption from provincial taxes, levies, duties or surcharges; or\n\nd. the authorisation of direct charges against a Provincial Revenue Fund.\n\n3. A provincial Act must provide for a procedure by which the province's legislature may amend a money Bill.\n\n[S. 120 substituted by s. 3 of Act No. 61 of 2001.]\n\n1. The Premier of a province must either assent to and sign a Bill passed by the provincial legislature in terms of this Chapter or, if the Premier has reservations about the constitutionality of the Bill, refer it back to the legislature for reconsideration.\n\n2. If, after reconsideration, a Bill fully accommodates the Premier's reservations, the Premier must assent to and sign the Bill; if not, the Premier must either ­\n\na. assent to and sign the Bill; or\n\nb. refer it to the Constitutional Court for a decision on its constitutionality.\n\n3. If the Constitutional Court decides that the Bill is constitutional, the Premier must assent to and sign it.\n\n1. Members of a provincial legislature may apply to the Constitutional Court for an order declaring that all or part of a provincial Act is unconstitutional.\n\n2. An application ­\n\na. must be supported by at least 20 per cent of the members of the legislature; and\n\nb. must be made within 30 days of the date on which the Premier assented to and signed the Act.\n\n3. The Constitutional Court may order that all or part of an Act that is the subject of an application in terms of subsection (1) has no force until the Court has decided the application if ­\n\na. the interests of justice require this; and\n\nb. the application has a reasonable prospect of success.\n\n4. If an application is unsuccessful, and did not have a reasonable prospect of success, the Constitutional Court may order the applicants to pay costs.\n\nA Bill assented to and signed by the Premier of a province becomes a provincial Act, must be published promptly and takes effect when published or on a date determined in terms of the Act.\n\nThe signed copy of a provincial Act is conclusive evidence of the provisions of that Act and, after publication, must be entrusted to the Constitutional Court for safekeeping .\n\nProvincial Executives\n\n1. The executive authority of a province is vested in the Premier of that province.\n\n2. The Premier exercises the executive authority, together with the other members of the Executive Council, by ­\n\na. implementing provincial legislation in the province;\n\nb. implementing all national legislation within the functional areas listed in Schedule 4 or 5 except where the Constitution or an Act of Parliament provides otherwise;\n\nc. administering in the province, national legislation outside the functional areas listed in Schedules 4 and 5, the administration of which has been assigned to the provincial executive in terms of an Act of Parliament;\n\nd. developing and implementing provincial policy;\n\ne. co-ordinating the functions of the provincial administration and its departments;\n\nf. preparing and initiating provincial legislation; and\n\ng. performing any other function assigned to the provincial executive in terms of the Constitution or an Act of Parliament.\n\n3. A province has executive authority in terms of subsection (2) (b) only to the extent that the province has the administrative capacity to assume effective responsibility. The national government, by legislative and other measures, must assist provinces to develop the administrative capacity required for the effective exercise of their powers and performance of their functions referred to in subsection (2).\n\n4. Any dispute concerning the administrative capacity of a province in regard to any function must be referred to the National Council of Provinces for resolution within 30 days of the date of the referral to the Council.\n\n5. Subject to section 100, the implementation of provincial legislation in a province is an exclusive provincial executive power.\n\n6. The provincial executive must act in accordance with ­\n\na. the Constitution; and\n\nb. the provincial constitution, if a constitution has been passed for the province.\n\nA member of the Executive Council of a province may assign any power or function that is to be exercised or performed in terms of an Act of Parliament or a provincial Act, to a Municipal Council. An assignment ­\n\na. must be in terms of an agreement between the relevant Executive Council member and the Municipal Council;\n\nb. must be consistent with the Act in terms of which the relevant power or function is exercised or performed; and\n\nc. takes effect upon proclamation by the Premier.\n\n1. The Premier of a province has the powers and functions entrusted to that office by the Constitution and any legislation.\n\n2. The Premier of a province is responsible for ­\n\na. assenting to and signing Bills;\n\nb. referring a Bill back to the provincial legislature for reconsideration of the Bill's constitutionality;\n\nc. referring a Bill to the Constitutional Court for a decision on the Bill's constitutionality;\n\nd. summoning the legislature to an extraordinary sitting to conduct special business;\n\ne. appointing commissions of inquiry; and\n\nf. calling a referendum in the province in accordance with national legislation.\n\n1. At its first sitting after its election, and whenever necessary to fill a vacancy, a provincial legislature must elect a woman or a man from among its members to be the Premier of the province.\n\n2. A judge designated by the Chief Justice must preside over the election of the Premier. The procedure set out in Part A of Schedule 3 applies to the election of the Premier.\n\n[Sub-s. (2) substituted by s. 10 of the Constitution Sixth Amendment Act of 2001.]\n\n3. An election to fill a vacancy in the office of Premier must be held at a time and on a date determined by the Chief Justice, but not later than 30 days after the vacancy occurs.\n\n[Sub-s. (2) substituted by s. 10 of the Constitution Sixth Amendment Act of 2001.]\n\nA Premier-elect must assume office within five days of being elected, by swearing or affirming faithfulness to the Republic and obedience to the Constitution, in accordance with Schedule 2.\n\n1. A Premier's term of office begins when the Premier assumes office and ends upon a vacancy occurring or when the person next elected Premier assumes office.\n\n2. No person may hold office as Premier for more than two terms, but when a person is elected to fill a vacancy in the office of Premier, the period between that election and the next election of a Premier is not regarded as a term.\n\n3. The legislature of a province, by a resolution adopted with a supporting vote of at least two thirds of its members, may remove the Premier from office only on the grounds of ­\n\na. a serious violation of the Constitution or the law;\n\nb. serious misconduct; or\n\nc. inability to perform the functions of office.\n\n4. Anyone who has been removed from the office of Premier in terms of subsection (3) (a) or (b) may not receive any benefits of that office, and may not serve in any public office.\n\n1. When the Premier is absent or otherwise unable to fulfil the duties of the office of Premier, or during a vacancy in the office of Premier, an office-bearer in the order below acts as the Premier:\n\na. A member of the Executive Council designated by the Premier.\n\nb. A member of the Executive Council designated by the other members of the Council.\n\nc. The Speaker, until the legislature designates one of its other members.\n\n2. An Acting Premier has the responsibilities, powers and functions of the Premier.\n\n3. Before assuming the responsibilities, powers and functions of the Premier, the Acting Premier must swear or affirm faithfulness to the Republic and obedience to the Constitution, in accordance with Schedule 2.\n\n1. The Executive Council of a province consists of the Premier, as head of the Council, and no fewer than five and no more than ten members appointed by the Premier from among the members of the provincial legislature.\n\n2. The Premier of a province appoints the members of the Executive Council, assigns their powers and functions, and may dismiss them.\n\n1. The members of the Executive Council of a province are responsible for the functions of the executive assigned to them by the Premier.\n\n2. Members of the Executive Council of a province are accountable collectively and individually to the legislature for the exercise of their powers and the performance of their functions.\n\n3. Members of the Executive Council of a province must ­\n\na. act in accordance with the Constitution and, if a provincial constitution has been passed for the province, also that constitution; and\n\nb. provide the legislature with full and regular reports concerning matters under their control.\n\nWhen an election of a provincial legislature is held, the Executive Council and its members remain competent to function until the person elected Premier by the next legislature assumes office.\n\nBefore members of the Executive Council of a province begin to perform their functions, they must swear or affirm faithfulness to the Republic and obedience to the Constitution, in accordance with Schedule 2.\n\n1. Members of the Executive Council of a province must act in accordance with a code of ethics prescribed by national legislation.\n\n2. Members of the Executive Council of a province may not ­\n\na. undertake any other paid work;\n\nb. act in any way that is inconsistent with their office, or expose themselves to any situation involving the risk of a conflict between their official responsibilities and private interests; or\n\nc. use their position or any information entrusted to them, to enrich themselves or improperly benefit any other person.\n\nThe Premier by proclamation may transfer to a member of the Executive Council ­\n\na. the administration of any legislation entrusted to another member; or\n\nb. any power or function entrusted by legislation to another member.\n\nThe Premier of a province may assign to a member of the Executive Council any power or function of another member who is absent from office or is unable to exercise that power or perform that function.\n\n1. When a municipality cannot or does not fulfil an executive obligation in terms of the Constitution or legislation, the relevant provincial executive may intervene by taking any appropriate steps to ensure fulfilment of that obligation, including-\n\na. issuing a directive to the Municipal Council, describing the extent of the failure to fulfil its obligations and stating any steps required to meet its obligations;\n\nb. assuming responsibility for the relevant obligation in that municipality to the extent necessary to-\n\ni. maintain essential national standards or meet established minimum standards for the rendering of a service;\n\nii. prevent that Municipal Council from taking unreasonable action that is prejudicial to the interests of another municipality or to the province as a whole; or\n\niii. maintain economic unity; or\n\nc. dissolving the Municipal Council and appointing an administrator until a newly elected Municipal Council has been declared elected, if exceptional circumstances warrant such a step.\n\n2. If a provincial executive intervenes in a municipality in terms of subsection (1)(b)-\n\na. it must submit a written notice of the intervention to-\n\ni. the Cabinet member responsible for local government affairs; and\n\nii. the relevant provincial legislature and the National Council of Provinces, within 14 days after the intervention began;\n\nb. the intervention must end if-\n\ni. the Cabinet member responsible for local government affairs disapproves the intervention within 28 days after the intervention began or by the end of that period has not approved the intervention; or\n\nii. the Council disapproves the intervention within 180 days after the intervention began or by the end of that period has not approved the intervention; and\n\nc. the Council must, while the intervention continues, review the intervention regularly and make any appropriate recommendations to the provincial executive.\n\n3. If a Municipal Council is dissolved in terms of subsection (1) (c) -\n\na. the provincial executive must immediately submit a written notice of the dissolution to-\n\ni. the Cabinet member responsible for local government affairs; and\n\nii. the relevant provincial legislature and the National Council of provinces; and\n\nb. the dissolution takes effect 14 days from the date of receipt of the notice by the Council unless set aside by that Cabinet member or the Council before the expiry of those 14 days.\n\n4. If a municipality cannot or does not fulfil an obligation in terms of the Constitution or legislation to approve a budget or any revenue-raising measures to give effect to the budget, the relevant provincial executive must intervene by taking any appropriate steps to ensure that the budget or those revenue-raising measures are approved, including dissolving the Municipal Council and-\n\na. appointing an administrator until a newly elected Municipal Council has been declared elected; and\n\nb. approving a temporary budget or revenue-raising measures to provide for the continued functioning of the municipality.\n\n5. If a municipality, as result of a crisis in its financial affairs, is in serious or persistent material breach of its obligations to provide basic services or to meet its financial commitments, or admits that it is unable to meet its obligations or financial commitments, the relevant provincial executive must-\n\na. impose a recovery plan aimed at securing the municipality's ability to meet its obligations to provide basic services or its financial commitments, which-\n\ni. is to be prepared in accordance with national legislation; and\n\nii. binds the municipality in the exercise of its legislative and executive authority, but only to the extent necessary to solve the crisis in its financial affairs; and\n\nb. dissolve the Municipal Council, if the municipality cannot or does not approve legislative measures, including a budget or any revenue-raising measures, necessary to give effect to the recovery plan, and-\n\ni. appoint an administrator until a newly elected Municipal Council has been declared elected; and\n\nii. approve a temporary budget or revenue-raising measures or any other measures giving effect to the recovery plan to provide for the continued functioning of the municipality; or\n\nc. if the Municipal Council is not dissolved in terms of paragraph (b) , assume responsibility for the implementation of the recovery plan to the extent that the municipality cannot or does not otherwise implement the recovery plan.\n\n6. If a provincial executive intervenes in a municipality in terms of subsection (4) or (5), it must submit a written notice of the intervention to-\n\na. the Cabinet member responsible for local government affairs; and\n\nb. the relevant provincial legislature and the National Council of Provinces, within seven days after the intervention began.\n\n7. If a provincial executive cannot or does not or does not adequately exercise the powers or perform the functions referred to in subsection (4) or (5), the national executive must intervene in terms of subsection (4) or (5) in the stead of the relevant provincial executive.\n\n8. National legislation may regulate the implementation of this section, including the processes established by this section.\n\n[S. 139 substituted by s. 4 of the Constitution Eleventh Amendment Act of 2003.]\n\n1. A decision by the Premier of a province must be in writing if it ­\n\na. is taken in terms of legislation; or\n\nb. has legal consequences.\n\n2. A written decision by the Premier must be countersigned by another Executive Council member if that decision concerns a function assigned to that other member.\n\n3. Proclamations, regulations and other instruments of subordinate legislation of a province must be accessible to the public.\n\n4. Provincial legislation may specify the manner in which, and the extent to which, instruments mentioned in subsection (3) must be ­\n\na. tabled in the provincial legislature; and\n\nb. approved by the provincial legislature.\n\n1. If a provincial legislature, by a vote supported by a majority of its members, passes a motion of no confidence in the province's Executive Council excluding the Premier, the Premier must reconstitute the Council.\n\n2. If a provincial legislature, by a vote supported by a majority of its members, passes a motion of no confidence in the Premier, the Premier and the other members of the Executive Council must resign.\n\nProvincial Constitutions\n\nA provincial legislature may pass a constitution for the province or, where applicable, amend its constitution, if at least two thirds of its members vote in favour of the Bill.\n\n1. A provincial constitution, or constitutional amendment, must not be inconsistent with this Constitution, but may provide for­\n\na. provincial legislative or executive structures and procedures that differ from those provided for in this Chapter; or\n\nb. the institution, role, authority and status of a traditional monarch, where applicable.\n\n2. Provisions included in a provincial constitution or constitutional amendment in terms of paragraphs (a) or (b) of subsection (1) ­\n\na. must comply with the values in section 1 and with Chapter 3 ; and\n\nb. may not confer on the province any power or function that falls ­\n\ni. outside the area of provincial competence in terms of Schedules 4 and 5; or\n\nii. outside the powers and functions conferred on the province by other sections of the Constitution.\n\n1. If a provincial legislature has passed or amended a constitution, the Speaker of the legislature must submit the text of the constitution or constitutional amendment to the Constitutional Court for certification.\n\n2. No text of a provincial constitution or constitutional amendment becomes law until the Constitutional Court has certified ­\n\na. that the text has been passed in accordance with section 142; and\n\nb. that the whole text complies with section 143.\n\nThe Premier of a province must assent to and sign the text of a provincial constitution or constitutional amendment that has been certified by the Constitutional Court.\n\nThe Premier of a province must assent to and sign the text of a provincial constitution or constitutional amendment that has been certified by the Constitutional Court.\n\nThe text assented to and signed by the Premier must be published in the national Government Gazette and takes effect on publication or on a later date determined in terms of that constitution or amendment.\n\nThe text assented to and signed by the Premier must be published in the national Government Gazette and takes effect on publication or on a later date determined in terms of that constitution or amendment.\n\nThe signed text of a provincial constitution or constitutional amendment is conclusive evidence of its provisions and, after publication, must be entrusted to the Constitutional Court for safekeeping.\n\nConflicting Laws\n\n1. This section applies to a conflict between national legislation and provincial legislation falling within a functional area listed in Schedule 4.\n\n2. National legislation that applies uniformly with regard to the country as a whole prevails over provincial legislation if any of the following conditions is met:\n\na. The national legislation deals with a matter that cannot be regulated effectively by legislation enacted by the respective provinces individually.\n\nb. The national legislation deals with a matter that, to be dealt with effectively, requires uniformity across the nation, and the national legislation provides that uniformity by establishing ­\n\ni. norms and standards;\n\nii. frameworks; or\n\niii. national policies.\n\nc. The national legislation is necessary for ­\n\ni. the maintenance of national security;\n\nii. the maintenance of economic unity;\n\niii. the protection of the common market in respect of the mobility of goods, services, capital and labour;\n\niv. the promotion of economic activities across provincial boundaries;\n\nv. the promotion of equal opportunity or equal access to government services; or\n\nvi. the protection of the environment.\n\n3. National legislation prevails over provincial legislation if the national legislation is aimed at preventing unreasonable action by a province that ­\n\na. is prejudicial to the economic, health or security interests of another province or the country as a whole; or\n\nb. impedes the implementation of national economic policy.\n\n4. When there is a dispute concerning whether national legislation is necessary for a purpose set out in subsection (2)(c) and that dispute comes before a court for resolution, the court must have due regard to the approval or the rejection of the legislation by the National Council of Provinces.\n\n5. Provincial legislation prevails over national legislation if subsection (2) or (3) does not apply.\n\n6. A law made in terms of an Act of Parliament or a provincial Act can prevail only if that law has been approved by the National Council of Provinces.\n\n7. If the National Council of Provinces does not reach a decision within 30 days of its first sitting after a law was referred to it, that law must be considered for all purposes to have been approved by the Council.\n\n8. If the National Council of Provinces does not approve a law referred to in subsection (6), it must, within 30 days of its decision, forward reasons for not approving the law to the authority that referred the law to it.\n\n1. If there is a conflict between national legislation and a provision of a provincial constitution with regard to ­\n\na. a matter concerning which this Constitution specifically requires or envisages the enactment of national legislation, the national legislation prevails over the affected provision of the provincial constitution;\n\nb. national legislative intervention in terms of section 44(2), the national legislation prevails over the provision of the provincial constitution; or\n\nc. a matter within a functional area listed in Schedule 4, section 146 applies as if the affected provision of the provincial constitution were provincial legislation referred to in that section.\n\n2. National legislation referred to in section 44(2) prevails over provincial legislation in respect of matters within the functional areas listed in Schedule 5.\n\nIf a dispute concerning a conflict cannot be resolved by a court, the national legislation prevails over the provincial legislation or provincial constitution.\n\nA decision by a court that legislation prevails over other legislation does not invalidate that other legislation, but that other legislation becomes inoperative for as long as the conflict remains.\n\nWhen considering an apparent conflict between national and provincial legislation, or between national legislation and a provincial constitution, every court must prefer any reasonable interpretation of the legislation or constitution that avoids a conflict, over any alternative interpretation that results in a conflict.\n\n\n\n- Translation in all official languages",
  "https://www.gov.za/documents/constitution/constitution-republic-south-africa-1996-chapter-7-local-government-07-feb": "The text below includes all amendments , up to and including the 17th Amendment to the Constitution ( disclaimer ).\n\nStatus of Municipalities\n\nObjects of Local Government\n\nDevelopmental Duties of Municipalities\n\nMunicipalities in Co-operative Government\n\nEstablishment of Municipalities\n\nPowers and Functions of Municipalities\n\nComposition and Election of Municipal Councils\n\nMembership of Municipal Councils\n\nTerms of Municipal Councils\n\nInternal Procedures\n\nPrivilege\n\nPublication of Municipal By-laws\n\nOrganised Local Government\n\nOther Matters\n\n151. Status of municipalities\n\n1. The local sphere of government consists of municipalities, which must be established for the whole of the territory of the Republic.\n\n2. The executive and legislative authority of a municipality is vested in its Municipal Council.\n\n3. A municipality has the right to govern, on its own initiative, the local government affairs of its community, subject to national and provincial legislation, as provided for in the Constitution.\n\n4. The national or a provincial government may not compromise or impede a municipality's ability or right to exercise its powers or perform its functions.\n\n152. Objects of local government\n\n1. The objects of local government are -\n\na. to provide democratic and accountable government for local communities;\n\nb. to ensure the provision of services to communities in a sustainable manner;\n\nc. to promote social and economic development;\n\nd. to promote a safe and healthy environment; and\n\ne. to encourage the involvement of communities and community organisations in the matters of local government.\n\n2. A municipality must strive, within its financial and administrative capacity, to achieve the objects set out in subsection (1).\n\n153. Developmental duties of municipalities\n\nA municipality must ­\n\na. structure and manage its administration, and budgeting and planning processes to give priority to the basic needs of the community, and to promote the social and economic development of the community; and\n\nb. participate in national and provincial development programmes.\n\n154. Municipalities in co-operative government\n\n1. The national government and provincial governments, by legislative and other measures, must support and strengthen the capacity of municipalities to manage their own affairs, to exercise their powers and to perform their functions.\n\n2. Draft national or provincial legislation that affects the status, institutions, powers or functions of local government must be published for public comment before it is introduced in Parliament or a provincial legislature, in a manner that allows organised local government, municipalities and other interested persons an opportunity to make representations with regard to the draft legislation.\n\n155. Establishment of municipalities\n\n1. There are the following categories of municipality:\n\na. Category A: A municipality that has exclusive municipal executive and legislative authority in its area.\n\nb. Category B: A municipality that shares municipal executive and legislative authority in its area with a category C municipality within whose area it falls.\n\nc. Category C: A municipality that has municipal executive and legislative authority in an area that includes more than one municipality.\n\n2. National legislation must define the different types of municipality that may be established within each category.\n\n3. National legislation must ­\n\na. establish the criteria for determining when an area should have a single category A municipality or when it should have municipalities of both category B and category C;\n\nb. establish criteria and procedures for the determination of municipal boundaries by an independent authority; and\n\nc. subject to section 229, make provision for an appropriate division of powers and functions between municipalities when an area has municipalities of both category B and category C. A division of powers and functions between a category B municipality and a category C municipality may differ from the division of powers and functions between another category B municipality and that category C municipality.\n\n4. The legislation referred to in subsection (3) must take into account the need to provide municipal services in an equitable and sustainable manner.\n\n5. Provincial legislation must determine the different types of municipality to be established in the province.\n\n6. Each provincial government must establish municipalities in its province in a manner consistent with the legislation enacted in terms of subsections (2) and (3) and, by legislative or other measures, must\n\na. provide for the monitoring and support of local government in the province; and\n\nb. promote the development of local government capacity to enable municipalities to perform their functions and manage their own affairs.\n\n[Subs-s. (6A) inserted by s. 1 of Act No. 87 of 1998 and deleted by s. 2 of the Constitution Twelfth Amendment Act, 2005.]\n\n7. The national government, subject to section 44, and the provincial governments have the legislative and executive authority to see to the effective performance by municipalities of their functions in respect of matters listed in Schedules 4 and 5, by regulating the exercise by municipalities of their executive authority referred to in section 156(1).\n\n156. Powers and functions of municipalities\n\n1. A municipality has executive authority in respect of, and has the right to administer ­\n\na. the local government matters listed in Part B of Schedule 4 and Part B of Schedule 5; and\n\nb. any other matter assigned to it by national or provincial legislation.\n\n2. A municipality may make and administer by-laws for the effective administration of the matters which it has the right to administer.\n\n3. Subject to section 151(4), a by-law that conflicts with national or provincial legislation is invalid. If there is a conflict between a by-law and national or provincial legislation that is inoperative because of a conflict referred to in section 149, the by-law must be regarded as valid for as long as that legislation is inoperative.\n\n4. The national government and provincial governments must assign to a municipality, by agreement and subject to any conditions, the administration of a matter listed in Part A of Schedule 4 or Part A of Schedule 5 which necessarily relates to local government, if ­\n\na. that matter would most effectively be administered locally; and\n\nb. the municipality has the capacity to administer it.\n\n5. A municipality has the right to exercise any power concerning a matter reasonably necessary for, or incidental to, the effective performance of its functions.\n\n157. Composition and election of Municipal Councils\n\n1. A Municipal Council consists of -\n\na. members elected in accordance with subsections (2), (3), (4) and (5); or\n\nb. if provided for by national legislation ­\n\ni. members appointed by other Municipal Councils to represent those other Councils; or\n\nii. both members elected in accordance with paragraph (a) and members appointed in accordance with subparagraph (i) of this paragraph.\n\n[Sub -s. (1) substituted by s. 1 (a) of Act No. 18 of 2002; and amended by s. 3 of the Constitution Fifteenth Amendment Act of 2009.]\n\n2. The election of members to a Municipal Council as anticipated in subsection (1)(a) must be in accordance with national legislation, which must prescribe a system ­\n\na. of proportional representation based on that municipality's segment of the national common voters roll, and which provides for the election of members from lists of party candidates drawn up in a party's order of preference; or\n\nb. of proportional representation as described in paragraph (a) combined with a system of ward representation based on that municipality's segment of the national common voters roll.\n\n3. An electoral system in terms of subsection (2) must result, in general in proportional representation.\n\n[Sub-s. (3) substituted by s.1 (b) of Act No. 18 0f 2002]\n\n\n\n4. If the electoral system includes ward representation, the delimitation of wards must be done by an independent authority appointed in terms of, and operating according to, procedures and criteria prescribed by national legislation.\n\n[Sub-s. (4) substituted by s. 2 of Act No. 87 of 1998. Para. (b) deleted by s. 3 of the Constitution Twelfth Amendment Act, 2005.]\n\n5. A person may vote in a municipality only if that person is registered on that municipality's segment of the national common voters roll.\n\n6. The national legislation referred to in subsection (1)(b) must establish a system that allows for parties and interests reflected within the Municipal Council making the appointment, to be fairly represented in the Municipal Council to which the appointment is made.\n\n158. Membership of Municipal Councils\n\n1. Every citizen who is qualified to vote for a Municipal Council is eligible to be a member of that Council, except ­\n\na. anyone who is appointed by, or is in the service of, the municipality and receives remuneration for that appointment or service, and who has not been exempted from this disqualification in terms of national legislation;\n\nb. anyone who is appointed by, or is in the service of, the state in another sphere, and receives remuneration for that appointment or service, and who has been disqualified from membership of a Municipal Council in terms of national legislation;\n\nc. anyone who is disqualified from voting for the National Assembly or is disqualified in terms of section 47(1)(c), (d) or (e) from being a member of the Assembly;\n\nd. a member of the National Assembly, a delegate to the National Council of Provinces or a member of a provincial legislature; but this disqualification does not apply to a member of a Municipal Council representing local government in the National Council; or\n\ne. a member of another Municipal Council; but this disqualification does not apply to a member of a Municipal Council representing that Council in another Municipal Council of a different category.\n\n2. A person who is not eligible to be a member of a Municipal Council in terms of subsection (1)(a), (b),(d) or (e) may be a candidate for the Council, subject to any limits or conditions established by national legislation.\n\n159. Terms of Municipal Councils\n\n1. The term of a Municipal Council may be no more than five years, as determined by national legislation.\n\n2. If a Municipal Council is dissolved in terms of national legislation, or when its term expires, an election must be held within 90 days of the date that Council was dissolved or its term expired.\n\n3. A Municipal Council, other than a Council that has been dissolved following and intervention in terms of section 139, remains competent to function from the time it is dissolved or its term expires, until the newly elected Council has been declared elected.\n\n[S. 159 substituted by s. 1 of Act No. 65 of 1998.]\n\n160. Internal procedures\n\n1. A Municipal Council ­\n\na. makes decisions concerning the exercise of all the powers and the performance of all the functions of the municipality;\n\nb. must elect its chairperson;\n\nc. may elect an executive committee and other committees, subject to national legislation; and\n\nd. may employ personnel that are necessary for the effective performance of its functions.\n\n2. The following functions may not be delegated by a Municipal Council:\n\na. The passing of by-laws;\n\nb. the approval of budgets;\n\nc. the imposition of rates and other taxes, levies and duties; and\n\nd. the raising of loans.\n\n3. The following functions may not be delegated by a Municipal Council:\n\na. A majority of the members of a Municipal Council must be present before a vote may be taken on any matter.\n\nb. All questions concerning matters mentioned in subsection (2) are determined by a decision taken by a Municipal Council with a supporting vote of a majority of its members.\n\nc. All other questions before a Municipal Council are decided by a majority of the votes cast.\n\n4. No by-law may be passed by a Municipal Council unless ­\n\na. all the members of the Council have been given reasonable notice; and\n\nb. the proposed by-law has been published for public comment.\n\n5. National legislation may provide criteria for determining ­\n\na. the size of a Municipal Council;\n\nb. whether Municipal Councils may elect an executive committee or any other committee; or\n\nc. the size of the executive committee or any other committee of a Municipal Council.\n\n6. A Municipal Council may make by-laws which prescribe rules and orders for ­\n\na. its internal arrangements;\n\nb. its business and proceedings; and\n\nc. the establishment, composition, procedures, powers and functions of its committees.\n\n7. A Municipal Council must conduct its business in an open manner, and may close its sittings, or those of its committees, only when it is reasonable to do so having regard to the nature of the business being transacted.\n\n8. Members of a Municipal Council are entitled to participate in its proceedings and those of its committees in a manner that ­\n\na. allows parties and interests reflected within the Council to be fairly represented;\n\nb. is consistent with democracy; and\n\nc. may be regulated by national legislation.\n\n161. Privilege\n\nProvincial legislation within the framework of national legislation may provide for privileges and immunities of Municipal Councils and their members.\n\n162. Publication of municipal by-laws\n\n1. A municipal by-law may be enforced only after it has been published in the official gazette of the relevant province.\n\n2. A provincial official gazette must publish a municipal by-law upon request by the municipality.\n\n3. Municipal by-laws must be accessible to the public.\n\n163. Organised local government\n\nAn Act of Parliament enacted in accordance with the procedure established by section 76 must ­\n\na. provide for the recognition of national and provincial organisations representing municipalities; and\n\nb. determine procedures by which local government may-\n\ni. consult with the national or a provincial government;\n\nii. designate representatives to participate in the National Council of Provinces; and\n\niii. participate in the process prescribed in the national legislation envisaged in section 221 (1) (c).\n\n[Para. (b) substituted by s. 4 of Act No. 61 of 2001.]\n\n164. Other matters\n\nAny matter concerning local government not dealt with in the Constitution may be prescribed by national legislation or by provincial legislation within the framework of national legislation.\n\n- Translation in all official languages",
  "https://www.gov.za/documents/constitution/constitution-republic-south-africa-1996-chapter-8-courts-and-administration": "The text below includes all amendments , up to and including the 17th Amendment to the Constitution ( disclaimer ).\n\n165. Judicial Authority 166. Judicial System 167. Constitutional Court 168. Supreme Court Appeal 169. High Court of South Africa 170. Other Courts 171. Court Procedures 172. Powers of Courts in Constitutional Matters 173. Inherent Power 174. Appointment of Judicial Officers 175. Appointment of acting judges 176. Terms of Office and Remuneration 177. Removal 178. Judicial Service Commission 179. Prosecuting Authority 180. Other Matters Concerning Administrationi of Justice\n\n165. Judicial authority\n\n1. The judicial authority of the Republic is vested in the courts.\n\n2. The courts are independent and subject only to the Constitution and the law, which they must apply impartially and without fear, favour or prejudice.\n\n3. No person or organ of state may interfere with the functioning of the courts.\n\n4. Organs of state, through legislative and other measures, must assist and protect the courts to ensure the independence, impartiality, dignity, accessibility and effectiveness of the courts.\n\n5. An order or decision issued by a court binds all persons to whom and organs of state to which it applies.\n\n6. The Chief Justice is the head of the judiciary and exercises responsibility over the establishment and monitoring of norms and standards for the excercise of the judicial functions of all courts.\n\n[Sub-s. (6) added by s. 1 of Constitution Seventeenth Amendment Act of 2012.]\n\n166. Judicial system\n\nThe courts are ­\n\na. the Constitutional Court;\n\nb. the Supreme Court of Appeal;\n\nc. the High Court of South Africa, and any high court of appeal that may be established by an Act of Parliament to hear appeals from any court of a status similar to the High Court of south Africa;\n\nd. the Magistrates' Courts; and\n\ne. any other court established or recognised in terms of an Act of Parliament, including any court of a status similar to either the High Court of South Africa or the Magistrates' Courts.\n\n[Sub-s (c) and (e) substituted by s. 2 of the Constitution Seventeenth Amendment Act of 2012.]\n\n167. Constitutional Court\n\n1. The Constitutional Court consists of the Chief Justice of South Africa, the Deputy Chief Justice and nine other judges.\n\n[Sub-s. (1) substituted by s. 11 of Act No. 34 of 2001.]\n\n2. A matter before the Constitutional Court must be heard by at least eight judges.\n\n3. The Constitutional Court ­\n\na. is the highest court of the Republic; and\n\nb. may decide\n\ni. constitutional matters; and\n\nii. any other matter, if the Constitutional Court grants leave to appeal on the grounds that the matter raises an arguable point of law of general public importance which ought to be considered by that Court; and\n\nc. makes the final decision whether a matter is within its jurisdiction.\n\n[Sub-s (3) substituted by s. 3 of the Constitution Seventeenth Amendment Act of 2012.]\n\n4. Only the Constitutional Court may ­\n\na. decide disputes between organs of state in the national or provincial sphere concerning the constitutional status, powers or functions of any of those organs of state;\n\nb. decide on the constitutionality of any parliamentary or provincial Bill, but may do so only in the circumstances anticipated in section 79 or 121;\n\nc. decide applications envisaged in section 80 or 122;\n\nd. decide on the constitutionality of any amendment to the Constitution;\n\ne. decide that Parliament or the President has failed to fulfil a constitutional obligation; or\n\nf. certify a provincial constitution in terms of section 144.\n\n5. The Constitutional Court makes the final decision whether an Act of Parliament, a provincial Act or conduct of the President is constitutional, and must confirm any order of invalidity made by the Supreme Court of Appeal, the High Court if South Afirca, or a court of similar status, before that order has any force.\n\n[Sub-s (5) substituted by s. 3 of the Constitution Seventeenth Amendment Act of 2012.]\n\n6. National legislation or the rules of the Constitutional Court must allow a person, when it is in the interests of justice and with leave of the Constitutional Court ­\n\na. to bring a matter directly to the Constitutional Court; or\n\nb. to appeal directly to the Constitutional Court from any other court.\n\n7. A constitutional matter includes any issue involving the interpretation, protection or enforcement of the Constitution.\n\n168. Supreme Court of Appeal\n\n1. The Supreme Court of Appeal consists of a President, a Deputy President and the number of judges of appeal determined in terms of an Act of Parliament.\n\n[Sub-s. (1) substituted by s. 12 of Act No. 34 of 2001.]\n\n2. A matter before the Supreme Court of Appeal must be decided by the number of judges determined in terms of an Act of Parliament.\n\n[Sub-s. (2) substituted by s. 12 of Act No. 34 of 2001.]\n\n3.        a. The Supreme Court of Appeal may decide appeals in any matter arising from the High Court of South Africa or a court of a status similar to the High Court of South Africa, except in respects of labour or competition matters to such extent as may be determined by an Act of Parliament.\n\nb. The Supreme Court of Appeal may decide only--\n\ni. appeals;\n\nii. issues connected with appeals; and\n\niii. any other matter that may be referred to it in circumstances defined by an Act of Parliament.\n\n[Sub-s (3) substituted by s. 4 of the Constitution Seventeenth Amendment Act of 2012.]\n\n169. High Court of South Africa\n\n1. The High Court of South Africa may decide ­--\n\na. any constitutional matter except a matter that ­\n\ni. the Constitutional Court has agreed to hear directly in terms of section 167(6)(a); or\n\nii. is assigned by an Act of Parliament to another court of a status similar to the High Court of South Africa; and\n\nb. any other matter not assigned to another court by an Act of Parliament.\n\n2. The High Court of South Africa consists of the Divisions determined by an Act of Parliament, which Act must provide for--\n\na. the establishing of Divisions, with one or two more seats in a Division; and\n\nb. the assigning of jurisdiction to a Division or a seat with a Division.\n\n3. Each Division of the High Court of South Afric--\n\na. has a Judge President;\n\nb. may have one or more Deputy Judges President; and\n\nc. has the number of other judges determined in terms of national legislation.\n\n[Sub-s (3) substituted by s. 4 of the Constitution Seventeenth Amendment Act of 2012.]\n\n170. Other courts\n\nAll courts other than those referred to in sections 167, 168 and 169 may decide any matter determined by an Act of Parliament, but a court of a status lower than the High Court of South Africa may not enquire into or rule on the constitutionality of any legislation or any conduct of the President.\n\n[S. 170 substituted by s. 6 of the Constitution Seventeenth Amendment Act of 2012.]\n\n171. Court procedures\n\nAll courts function in terms of national legislation, and their rules and procedures must be provided for in terms of national legislation.\n\n172. Powers of courts in constitutional matters\n\n1. When deciding a constitutional matter within its power, a court ­\n\na. must declare that any law or conduct that is inconsistent with the Constitution is invalid to the extent of its inconsistency; and\n\nb. may make any order that is just and equitable, including ­\n\ni. an order limiting the retrospective effect of the declaration of invalidity; and\n\nii. an order suspending the declaration of invalidity for any period and on any conditions, to allow the competent authority to correct the defect.\n\n2.        a. The Supreme Court of Appeal, the High Court of South Africa or a court of similar status may make an order concerning the constitutional validity of an Act of Parliament, a provincial Act or any conduct of the President, but an order of constitutional invalidity has no force unless it is confirmed by the Constitutional Court.\n\n[Par (a) substituted by s. 7 of the Constitution Seventeenth Amendment Act of 2012.]\n\nb. A court which makes an order of constitutional invalidity may grant a temporary interdict or other temporary relief to a party, or may adjourn the proceedings, pending a decision of the Constitutional Court on the validity of that Act or conduct.\n\nc. National legislation must provide for the referral of an order of constitutional invalidity to the Constitutional Court.\n\nd. Any person or organ of state with a sufficient interest may appeal, or apply, directly to the Constitutional Court to confirm or vary an order of constitutional invalidity by a court in terms of this subsection.\n\n173. Inherent power\n\nThe Constitutional Court, the Supreme Court of Appeal and the High Court of South Africa each has the inherent power to protect and regulate their own process, and to develop the common law, taking into account the interests of justice.\n\n[S. 173 substituted by s. 8 of the Constitution Seventeenth Amendment Act of 2012.]\n\n174. Appointment of judicial officers\n\n1. Any appropriately qualified woman or man who is a fit and proper person may be appointed as a judicial officer. Any person to be appointed to the Constitutional Court must also be a South African citizen.\n\n2. The need for the judiciary to reflect broadly the racial and gender composition of South Africa must be considered when judicial officers are appointed.\n\n3. The President as head of the national executive, after consulting the Judicial Service Commission and the leaders of parties represented in the National Assembly, appoints the Chief Justice and the Deputy Chief Justice and, after consulting the Judicial Service Commission, appoints the President and Deputy President of the Supreme Court of Appeal.\n\n[Sub-s. (3) substituted by s. 13 of Act No. 34 of 2001.]\n\n4. The other judges of the Constitutional Court are appointed by the President, as head of the national executive, after consulting the Chief Justice and the leaders of parties represented in the National Assembly, in accordance with the following procedure:\n\na. The Judicial Service Commission must prepare a list of nominees with three names more than the number of appointments to be made, and submit the list to the President.\n\nb. The President may make appointments from the list, and must advise the Judicial Service Commission, with reasons, if any of the nominees are unacceptable and any appointment remains to be made.\n\nc. The Judicial Service Commission must supplement the list with further nominees and the President must make the remaining appointments from the supplemented list.\n\n[Sub-s. (4) substituted by s. 13 of Act No. 34 of 2001.]\n\n5. At all times, at least four members of the Constitutional Court must be persons who were judges at the time they were appointed to the Constitutional Court.\n\n6. The President must appoint the judges of all other courts on the advice of the Judicial Service Commission.\n\n7. Other judicial officers must be appointed in terms of an Act of Parliament which must ensure that the appointment, promotion, transfer or dismissal of, or disciplinary steps against, these judicial officers take place without favour or prejudice.\n\n8. Before judicial officers begin to perform their functions, they must take an oath or affirm, in accordance with Schedule 2, that they will uphold and protect the Constitution.\n\n175. Appointment of acting judges\n\n1. The President may appoint a woman or a man to serve as an acting Deputy Chief Justice or judge of the Constitutional Court if there is a vacancy in any of those offices, or if the person holding such an office is absent. The appointment must be made on the recommendation of the Cabinet member responsible for the administration of justice acting with the concurrence of the Chief Justice, and an appointment as acting Deputy Chief Justice must be made from the ranks of the judges who had been appointed to the Constitutional Court in terms of section 174(4).\n\n2. The Cabinet member responsible for the administration of justice must appoint acting judges to other courts after consulting the senior judge of the court on which the acting judge will serve.\n\n[S. 175 substituted by s. 9 of the Constitution Seventeenth Amendment Act of 2012.]\n\n176. Terms of office and remuneration\n\n1. A Constitutional Court judge holds office for a non-renewable term of 12 years, or until he or she attains the age of 70, whichever occurs first, except where an Act of Parliament extends the term of office of a Constitutional Court judge.\n\n[Sub-s. (1) substituted by s. 15 of Act No. 34 of 2001.]\n\n2. Other judges hold office until they are discharged from active service in terms of an Act of Parliament.\n\n3. The salaries, allowances and benefits of judges may not be reduced.\n\n177. Removal\n\n1. A judge may be removed from office only if ­\n\na. the Judicial Service Commission finds that the judge suffers from an incapacity, is grossly incompetent or is guilty of gross misconduct; and\n\nb. the National Assembly calls for that judge to be removed, by a resolution adopted with a supporting vote of at least two thirds of its members.\n\n2. The President must remove a judge from office upon adoption of a resolution calling for that judge to be removed.\n\n3. The President, on the advice of the Judicial Service Commission, may suspend a judge who is the subject of a procedure in terms of subsection (1).\n\n178. Judicial Service Commission\n\n1. There is a Judicial Service Commission consisting of\n\na. the Chief Justice, who presides at meetings of the Commission;\n\nb. the President of the Supreme Court of Appeal;\n\n[Para. (b) substituted by s. 16 (a) of Act No. 34 of 2001.]\n\nc. one Judge President designated by the Judges President;\n\nd. the Cabinet member responsible for the administration of justice, or an alternate designated by that Cabinet member;\n\ne. two practising advocates nominated from within the advocates' profession to represent the profession as a whole, and appointed by the President;\n\nf. two practising attorneys nominated from within the attorneys' profession to represent the profession as a whole, and appointed by the President;\n\ng. one teacher of law designated by teachers of law at South African universities;\n\nh. six persons designated by the National Assembly from among its members, at least three of whom must be members of opposition parties represented in the Assembly;\n\ni. four permanent delegates to the National Council of Provinces designated together by the Council with a supporting vote of at least six provinces;\n\nj. four persons designated by the President as head of the national executive, after consulting the leaders of all the parties in the National Assembly; and\n\nk. when considering matters relating to a specific Division of the High Court of South Africa, the Judge President of that Division and the Premier of the province concerned, or an alternate designated by each of them.\n\n[Para. (k) substituted by s. 2(a) of the Constitution Second Amendment Act of 1998, by s. 16(b) of the Constitution Sixth Amendment Act of 2001 and by s. 10 of the Constitution Seventeenth Amendment Act of 2012.]\n\n2. If the number of persons nominated from within the advocates' or attorneys' profession in terms of subsection (1) (e) or (f) equals the number of vacancies to be filled, the President must appoint them. If the number of persons nominated exceeds the number of vacancies to be filled, the President, after consulting the relevant profession, must appoint sufficient of the nominees to fill the vacancies, taking into account the need to ensure that those appointed represent the profession as a whole.\n\n3. Members of the Commission designated by the National Council of Provinces serve until they are replaced together, or until any vacancy occurs in their number. Other members who were designated or nominated to the Commission serve until they are replaced by those who designated or nominated them.\n\n4. The Judicial Service Commission has the powers and functions assigned to it in the Constitution and national legislation.\n\n5. The Judicial Service Commission may advise the national government on any matter relating to the judiciary or the administration of justice, but when it considers any matter except the appointment of a judge, it must sit without the members designated in terms of subsection (1) (h) and (i).\n\n6. The Judicial Service Commission may determine its own procedure, but decisions of the Commission must be supported by a majority of its members.\n\n7. If the Chief Justice or the President of the Supreme Court of Appeal is temporarily unable to serve on the Commission, the Deputy Chief Justice or the Deputy President of the Supreme Court of Appeal, as the case may be, acts as his or her alternate on the Commission.\n\n[Sub-s. (7) added by s. 2 (b) of Act No. 65 of 1998 and substituted by s. 16 (c) of Act No. 34 of 2001.]\n\n8. The President and the persons who appoint, nominate or designate the members of the Commission in terms of subsection (1) (c), (e), (f) and (g), may, in the same manner appoint, nominate or designate an alternate for each of those members, to serve on the Commission whenever the member concerned is temporarily unable to do so by reason of his or her incapacity or absence from the Republic or any other sufficient reason.\n\n[Sub-s. (8) added by s. 2 (b) of Act No. 65 of 1998.]\n\n179. Prosecuting authority\n\n1. There is a single national prosecuting authority in the Republic, structured in terms of an Act of Parliament, and consisting of ­\n\na. a National Director of Public Prosecutions, who is the head of the prosecuting authority, and is appointed by the President, as head of the national executive; and\n\nb. Directors of Public Prosecutions and prosecutors as determined by an Act of Parliament.\n\n2. The prosecuting authority has the power to institute criminal proceedings on behalf of the state, and to carry out any necessary functions incidental to instituting criminal proceedings.\n\n3. National legislation must ensure that the Directors of Public Prosecutions ­\n\na. are appropriately qualified; and\n\nb. are responsible for prosecutions in specific jurisdictions, subject to subsection (5).\n\n4. National legislation must ensure that the prosecuting authority exercises its functions without fear, favour or prejudice.\n\n5. The National Director of Public Prosecutions ­\n\na. must determine, with the concurrence of the Cabinet member responsible for the administration of justice, and after consulting the Directors of Public Prosecutions, prosecution policy, which must be observed in the prosecution process;\n\nb. must issue policy directives which must be observed in the prosecution process;\n\nc. may intervene in the prosecution process when policy directives are not complied with; and\n\nd. may review a decision to prosecute or not to prosecute, after consulting the relevant Director of Public Prosecutions and after taking representations within a period specified by the National Director of Public Prosecutions, from the following:\n\ni. The accused person.\n\nii. The complainant.\n\niii. Any other person or party whom the National Director considers to be relevant.\n\n6. The Cabinet member responsible for the administration of justice must exercise final responsibility over the prosecuting authority.\n\n7. All other matters concerning the prosecuting authority must be determined by national legislation.\n\n180. Other matters concerning administration of justice\n\nNational legislation may provide for any matter concerning the administration of justice that is not dealt with in the Constitution, including ­\n\na. training programmes for judicial officers;\n\nb. procedures for dealing with complaints about judicial officers; and\n\nc. the participation of people other than judicial officers in court decisions.\n\n- - Translation in all official languages",
  "https://www.gov.za/documents/constitution/constitution-republic-south-africa-1996-chapter-9-state-institutions": "Establishment and governing principles\n\nPublic Protector\n\nFunctions of Public Protector\n\nTenure\n\nSouth African Human Rights Commission\n\nFunctions of Human Rights Commission\n\nCommission for the Promotion and Protection of the Rights of Cultural, Religious and Linguistic Communities\n\nComposition of Commission\n\nFunctions of Commission\n\nCommission for Gender Equality\n\nFunctions of Commission for Gender Equality\n\nAuditor-General\n\nFunctions of Auditor-General\n\nTenure\n\nElectoral Commission\n\nFunctions of Electoral Commission\n\nComposition of Electoral Commission\n\nIndependent Authority to Regulate Broadcasting\n\nBroadcasting Authority\n\nGeneral Provisions\n\nAppointments\n\nRemoval from office\n\n181. Establishment and governing principles\n\n1. The following state institutions strengthen constitutional democracy in the Republic:\n\na. The Public Protector.\n\nb. The South African Human Rights Commission.\n\nc. The Commission for the Promotion and Protection of the Rights of Cultural, Religious and Linguistic Communities.\n\nd. The Commission for Gender Equality.\n\ne. The Auditor-General.\n\nf. The Electoral Commission.\n\n2. These institutions are independent, and subject only to the Constitution and the law, and they must be impartial and must exercise their powers and perform their functions without fear, favour or prejudice.\n\n3. Other organs of state, through legislative and other measures, must assist and protect these institutions to ensure the independence, impartiality, dignity and effectiveness of these institutions.\n\n4. No person or organ of state may interfere with the functioning of these institutions.\n\n5. These institutions are accountable to the National Assembly, and must report on their activities and the performance of their functions to the Assembly at least once a year.\n\nPublic Protector\n\n182. Functions of Public Protector\n\n1. The Public Protector has the power, as regulated by national legislation ­\n\na. to investigate any conduct in state affairs, or in the public administration in any sphere of government, that is alleged or suspected to be improper or to result in any impropriety or prejudice;\n\nb. to report on that conduct; and\n\nc. to take appropriate remedial action.\n\n2. The Public Protector has the additional powers and functions prescribed by national legislation.\n\n3. The Public Protector may not investigate court decisions.\n\n4.The Public Protector must be accessible to all persons and communities.\n\n5. Any report issued by the Public Protector must be open to the public unless exceptional circumstances, to be determined in terms of national legislation, require that a report be kept confidential.\n\n183. Tenure\n\nThe Public Protector is appointed for a non-renewable period of seven years.\n\nSouth African Human Rights Commission\n\n184. Functions of South African Human Rights Commission\n\n1. The South African Human Rights Commission must ­\n\na. promote respect for human rights and a culture of human rights;\n\nb. promote the protection, development and attainment of human rights; and\n\nc. monitor and assess the observance of human rights in the Republic.\n\n2. The South African Human Rights Commission has the powers, as regulated by national legislation, necessary to perform its functions, including the power ­\n\na. to investigate and to report on the observance of human rights;\n\nb. to take steps to secure appropriate redress where human rights have been violated;\n\nc. to carry out research; and\n\nd. to educate.\n\n3. Each year, the South African Human Rights Commission must require relevant organs of state to provide the Commission with information on the measures that they have taken towards the realisation of the rights in the Bill of Rights concerning housing, health care, food, water, social security, education and the environment.\n\n4. The South African Human Rights Commission has the additional powers and functions prescribed by national legislation.\n\nCommission for the Promotion and Protection of the Rights of Cultural, Religious and Linguistic Communities\n\n185. Functions of Commission\n\n1. The primary objects of the Commission for the Promotion and Protection of the Rights of Cultural, Religious and Linguistic Communities are ­\n\na. to promote respect for the rights of cultural, religious and linguistic communities;\n\nb. to promote and develop peace, friendship, humanity, tolerance and national unity among cultural, religious and linguistic communities, on the basis of equality, non-discrimination and free association; and\n\nc. to recommend the establishment or recognition, in accordance with national legislation, of a cultural or other council or councils for a community or communities in South Africa.\n\n2. The Commission has the power, as regulated by national legislation, necessary to achieve its primary objects, including the power to monitor, investigate, research, educate, lobby, advise and report on issues concerning the rights of cultural, religious and linguistic communities.\n\n3. The Commission may report any matter which falls within its powers and functions to the South African Human Rights Commission for investigation.\n\n4. The Commission has the additional powers and functions prescribed by national legislation.\n\n186. Composition of Commission\n\n1. The number of members of the Commission for the Promotion and Protection of the Rights of Cultural, Religious and Linguistic Communities and their appointment and terms of office must be prescribed by national legislation.\n\n2. The composition of the Commission must-\n\na. be broadly representative of the main cultural, religious and linguistic communities in South Africa; and\n\nb. broadly reflect the gender composition of South Africa.\n\nCommission for Gender Equality\n\n187. Functions of Commission for Gender Equality\n\n1. The Commission for Gender Equality must promote respect for gender equality and the protection, development and attainment of gender equality.\n\n2. The Commission for Gender Equality has the power, as regulated by national legislation, necessary to perform its functions, including the power to monitor, investigate, research, educate, lobby, advise and report on issues concerning gender equality.\n\n3. The Commission for Gender Equality has the additional powers and functions prescribed by national legislation.\n\nAuditor-General\n\n188. Functions of Auditor-General\n\n1. The Auditor-General must audit and report on the accounts, financial statements and financial management of ­\n\na. all national and provincial state departments and administrations;\n\nb. all municipalities; and\n\nc. any other institution or accounting entity required by\n\n2. In addition to the duties prescribed in subsection (1), and subject to any legislation, the Auditor-General may audit and report on the accounts, financial statements and financial management of ­\n\na. any institution funded from the National Revenue Fund or a Provincial Revenue Fund or by a municipality; or\n\nb. any institution that is authorised in terms of any law to receive money for a public purpose.\n\n3. The Auditor-General must submit audit reports to any legislature that has a direct interest in the audit, and to any other authority prescribed by national legislation. All reports must be made public.\n\n4. The Auditor-General has the additional powers and functions prescribed by national legislation.\n\n189. Tenure\n\nThe Auditor-General must be appointed for a fixed, non-renewable term of between five and ten years.\n\nElectoral Commission\n\n190. Functions of Electoral Commission\n\n1. The Electoral Commission must ­\n\na. manage elections of national, provincial and municipal legislative bodies in accordance with national legislation;\n\nb. ensure that those elections are free and fair; and\n\nc. declare the results of those elections within a period that must be prescribed by national legislation and that is as short as reasonably possible.\n\n2. The Electoral Commission has the additional powers and functions prescribed by national legislation.\n\n191. Composition of Electoral Commission\n\nThe Electoral Commission must be composed of at least three persons. The number of members and their terms of office must be prescribed by national legislation.\n\nIndependent Authority to Regulate Broadcasting\n\n192. Broadcasting Authority\n\nNational legislation must establish an independent authority to regulate broadcasting in the public interest, and to ensure fairness and a diversity of views broadly representing South African society.\n\nGeneral Provisions\n\n193. Appointments\n\n1. The Public Protector and the members of any Commission established by this Chapter must be women or men who ­\n\na. are South African citizens;\n\nb. are fit and proper persons to hold the particular office; and\n\nc. comply with any other requirements prescribed by national legislation.\n\n2. The need for a Commission established by this Chapter to reflect broadly the race and gender composition of South Africa must be considered when members are appointed.\n\n3. The Auditor-General must be a woman or a man who is a South African citizen and a fit and proper person to hold that office. Specialised knowledge of, or experience in, auditing, state finances and public administration must be given due regard in appointing the Auditor-General.\n\n4. The President, on the recommendation of the National Assembly, must appoint the Public Protector, the Auditor-General and the members of ­\n\na. the South African Human Rights Commission;\n\nb. the Commission for Gender Equality; and\n\nc. the Electoral Commission.\n\n5. The National Assembly must recommend persons ­\n\na. nominated by a committee of the Assembly proportionally composed of members of all parties represented in the Assembly; and\n\nb. approved by the Assembly by a resolution adopted with a supporting vote ­\n\ni. of at least 60 per cent of the members of the Assembly, if the recommendation concerns the appointment of the Public Protector or the Auditor-General; or\n\nii. of a majority of the members of the Assembly, if the recommendation concerns the appointment of a member of a Commission.\n\n6. The involvement of civil society in the recommendation process may be provided for as envisaged in section 59(1)(a).\n\n194. Removal from office\n\n1. The Public Protector, the Auditor-General or a member of a Commission established by this Chapter may be removed from office only on ­\n\na. the ground of misconduct, incapacity or incompetence;\n\nb. a finding to that effect by a committee of the National Assembly; and\n\nc. the adoption by the Assembly of a resolution calling for that person's removal from office.\n\n2. A resolution of the National Assembly concerning the removal from office of ­\n\na. the Public Protector or the Auditor-General must be adopted with a supporting vote of at least two thirds of the members of the Assembly; or\n\nb. a member of a Commission must be adopted with a supporting vote of a majority of the members of the Assembly.\n\n3. The President ­\n\na. may suspend a person from office at any time after the start of the proceedings of a committee of the National Assembly for the removal of that person; and\n\nb. must remove a person from office upon adoption by the Assembly of the resolution calling for that person's removal.\n\n- Translation in all official languages",
  "https://www.gov.za/documents/constitution/constitution-republic-south-africa-1996-chapter-10-public-administration-07": "The text below includes all amendments , up to and including the 17th Amendment to the Constitution ( disclaimer ).\n\n195. Basic values and principles governing public administration 196. Public Service Commission 197. Public Service\n\n195. Basic values and principles governing public administration\n\n1. Public administration must be governed by the democratic values and principles enshrined in the Constitution, including the following principles:\n\na. A high standard of professional ethics must be promoted and maintained.\n\nb. Efficient, economic and effective use of resources must be promoted.\n\nc. Public administration must be development-oriented.\n\nd. Services must be provided impartially, fairly, equitably and without bias.\n\ne. People's needs must be responded to, and the public must be encouraged to participate in policy-making.\n\nf. Public administration must be accountable.\n\ng. Transparency must be fostered by providing the public with timely, accessible and accurate information.\n\nh. Good human-resource management and career-development practices, to maximise human potential, must be cultivated.\n\ni. Public administration must be broadly representative of the South African people, with employment and personnel management practices based on ability, objectivity,  fairness, and the need to redress the imbalances of the past to achieve broad representation.\n\n2. The above principles apply to ­\n\na. administration in every sphere of government;\n\nb. organs of state; and\n\nc. public enterprises.\n\n3. National legislation must ensure the promotion of the values and principles listed in subsection (1).\n\n4. The appointment in public administration of a number of persons on policy considerations is not precluded, but national legislation must regulate these appointments in the public service.\n\n5. Legislation regulating public administration may differentiate between different sectors, administrations or institutions.\n\n6. The nature and functions of different sectors, administrations or institutions of public administration are relevant factors to be taken into account in legislation regulating public administration.\n\n196. Public Service Commission\n\n1. There is a single Public Service Commission for the Republic.\n\n2. The Commission is independent and must be impartial, and must exercise its powers and perform its functions without fear, favour or prejudice in the interest of the maintenance of effective and efficient public administration and a high standard of professional ethics in the public service. The Commission must be regulated by national legislation.\n\n3. Other organs of state, through legislative and other measures, must assist and protect the Commission to ensure the independence, impartiality, dignity and effectiveness of the Commission. No person or organ of state may interfere with the functioning of the Commission.\n\n4. The powers and functions of the Commission are -\n\na. to promote the values and principles set out in section 195, throughout the public service;\n\nb. to investigate, monitor and evaluate the organisation and administration, and the personnel practices, of the public service;\n\nc. to propose measures to ensure effective and efficient performance within the public service;\n\nd. to give directions aimed at ensuring that personnel procedures relating to recruitment, transfers, promotions and dismissals comply with the values and principles set out in section 195;\n\ne. to report in respect of its activities and the performance of its functions, including any finding it may make and directions and advice it may give, and to provide an evaluation of the extent to which the values and principles set out in section 195 are complied with; and\n\nf. either of its own accord or on receipt of any complaint -\n\ni. to investigate and evaluate the application of personnel and public administration practices, and to report to the relevant executive authority and legislature;\n\nii. to investigate grievances of employees in the public service concerning official acts or omissions, and recommend appropriate remedies;\n\niii. to monitor and investigate adherence to applicable procedures in the public service; and\n\niv. to advise national and provincial organs of state regarding personnel practices in the public service, including those relating to the recruitment, appointment, transfer, discharge and other aspects of the careers of employees in the public service; and\n\ng. to exercise or perform the additional powers or functions prescribed by and Act of Parliament.\n\n[Para. (g) added by s. 3 of Act No. 65 of 1998.]\n\n5. The Commission is accountable to the National Assembly.\n\n6. The Commission must report at least once a year in terms of subsection (4)(e) ­\n\na. to the National Assembly; and\n\nb. in respect of its activities in a province, to the legislature of that province.\n\n7. The Commission has the following 14 commissioners appointed by the President:\n\na. Five commissioners approved by the National Assembly in accordance with subsection (8)(a); and\n\nb. one commissioner for each province nominated by the Premier of the province in accordance with subsection (8)(b).\n\n\n\n8.        a. A commissioner appointed in terms of subsection (7)(a) must be -\n\ni. recommended by a committee of the National Assembly that is proportionally composed of members of all parties represented in the Assembly; and\n\nii. approved by the Assembly by a resolution adopted with a supporting vote of a majority of its members.\n\nb. A commissioner nominated by the Premier of a province must be -\n\ni. recommended by a committee of the provincial legislature that is proportionally composed of members of all parties represented in the legislature; and\n\nii. approved by the legislature by a resolution adopted with a supporting vote of a majority of its members.\n\n9. An Act of Parliament must regulate the procedure for the appointment of commissioners.\n\n10. A commissioner is appointed for a term of five years, which is renewable for one additional term only, and must be a woman or a man who is ­\n\na. a South African citizen; and\n\nb. a fit and proper person with knowledge of, or experience in, administration, management or the provision of public services.\n\n11. A commissioner may be removed from office only on ­\n\na. the ground of misconduct, incapacity or incompetence;\n\nb. a finding to that effect by a committee of the National Assembly or, in the case of a commissioner nominated by the Premier of a province, by a committee of the legislature of that province; and\n\nc. the adoption by the Assembly or the provincial legislature concerned, of a resolution with a supporting vote of a majority of its members calling for the commissioner's removal from office.\n\n12. The President must remove the relevant commissioner from office upon ­\n\na. the adoption by the Assembly of a resolution calling for that commissioner's removal; or\n\nb. written notification by the Premier that the provincial legislature has adopted a resolution calling for that commissioner's removal.\n\n13. Commissioners referred to in subsection (7)(b) may exercise the powers and perform the functions of the Commission in their provinces as prescribed by national legislation.\n\n197. Public Service\n\n1. Within public administration there is a public service for the Republic, which must function, and be structured, in terms of national legislation, and which must loyally execute the lawful policies of the government of the day.\n\n2. The terms and conditions of employment in the public service must be regulated by national legislation. Employees are entitled to a fair pension as regulated by national legislation.\n\n3. No employee of the public service may be favoured or prejudiced only because that person supports a particular political party or cause.\n\n4. Provincial governments are responsible for the recruitment, appointment, promotion, transfer and dismissal of members of the public service in their administrations within a framework of uniform norms and standards applying to the public service.\n\n- Translation in all official languages",
  "https://www.gov.za/documents/constitution/constitution-republic-south-africa-1996-chapter-11-security-services-07-feb": "The text below includes all amendments , up to and including the 17th Amendment to the Constitution ( disclaimer ).\n\n198. Governing principles 199. Establishment, structuring and conduct of security services\n\nDefence\n\n200. Defence force 201. Political responsibility 202. Command of defence force 203. State of national defence 204. Defence civilian secretariat\n\nPolice\n\n205. Police service 206. Political responsibility 207. Control of police service 208. Police civilian secretariat\n\nIntelligence\n\n209. Establishment and control of intelligence services 210. Powers, functions and monitoring\n\n198. Governing principles\n\nThe following principles govern national security in the Republic:\n\na. National security must reflect the resolve of South Africans, as individuals and as a nation, to live as equals, to live in peace and harmony, to be free from fear and want and to seek a better life.\n\nb. The resolve to live in peace and harmony precludes any South African citizen from participating in armed conflict, nationally or internationally, except as provided for in terms of the Constitution or national legislation.\n\nc. National security must be pursued in compliance with the law, including international law.\n\nd. National security is subject to the authority of Parliament and the national executive.\n\n199. Establishment, structuring and conduct of security services\n\n1. The security services of the Republic consist of a single defence force, a single police service and any intelligence services established in terms of the Constitution.\n\n2. The defence force is the only lawful military force in the Republic.\n\n3. Other than the security services established in terms of the Constitution, armed organisations or services may be established only in terms of national legislation.\n\n4. The security services must be structured and regulated by national legislation.\n\n5. The security services must act, and must teach and require their members to act, in accordance with the Constitution and the law, including customary international law and international agreements binding on the Republic.\n\n6. No member of any security service may obey a manifestly illegal order.\n\n7. Neither the security services, nor any of their members, may, in the performance of their functions ­\n\na. prejudice a political party interest that is legitimate in terms of the Constitution; or\n\nb. further, in a partisan manner, any interest of a political party.\n\n8. To give effect to the principles of transparency and accountability, multi-party parliamentary committees must have oversight of all security services in a manner determined by national legislation or the rules and orders of Parliament.\n\nDefence\n\n200. Defence force\n\n1. The defence force must be structured and managed as a disciplined military force.\n\n2. The primary object of the defence force is to defend and protect the Republic, its territorial integrity and its people in accordance with the Constitution and the principles of international law regulating the use of force.\n\n201. Political responsibility\n\n1. A member of the Cabinet must be responsible for defence.\n\n2. Only the President, as head of the national executive, may authorise the employment of the defence force ­\n\na. in co-operation with the police service;\n\nb. in defence of the Republic; or\n\nc. in fulfilment of an international obligation.\n\n3. When the defence force is employed for any purpose mentioned in subsection (2), the President must inform Parliament, promptly and in appropriate detail, of ­\n\na. the reasons for the employment of the defence force;\n\nb. any place where the force is being employed;\n\nc. the number of people involved; and\n\nd. the period for which the force is expected to be employed.\n\n4. If Parliament does not sit during the first seven days after the defence force is employed as envisaged in subsection (2), the President must provide the information required in subsection (3) to the appropriate oversight committee.\n\n202. Command of defence force\n\n1. The President as head of the national executive is Commander-in- Chief of the defence force, and must appoint the Military Command of the defence force.\n\n2. Command of the defence force must be exercised in accordance with the directions of the Cabinet member responsible for defence, under the authority of the President.\n\n203. State of national defence\n\n1. The President as head of the national executive may declare a state of national defence, and must inform Parliament promptly and in appropriate detail of ­\n\na. the reasons for the declaration;\n\nb. any place where the defence force is being employed; and\n\nc. the number of people involved.\n\n2. If Parliament is not sitting when a state of national defence is declared, the President must summon Parliament to an extraordinary sitting within seven days of the declaration.\n\n3. A declaration of a state of national defence lapses unless it is approved by Parliament within seven days of the declaration.\n\n204. Defence civilian secretariat\n\nA civilian secretariat for defence must be established by national legislation to function under the direction of the Cabinet member responsible for defence.\n\nPolice\n\n205. Police service\n\n1. The national police service must be structured to function in the national, provincial and, where appropriate, local spheres of government.\n\n2. National legislation must establish the powers and functions of the police service and must enable the police service to discharge its responsibilities effectively, taking into account the requirements of the provinces.\n\n3. The objects of the police service are to prevent, combat and investigate crime, to maintain public order, to protect and secure the inhabitants of the Republic and their property, and to uphold and enforce the law.\n\n206. Political responsibility\n\n1. A member of the Cabinet must be responsible for policing and must determine national policing policy after consulting the provincial governments and taking into account the policing needs and priorities of the provinces as determined by the provincial executives.\n\n2. The national policing policy may make provision for different policies in respect of different provinces after taking into account the policing needs and priorities of these provinces.\n\n3. Each province is entitled ­\n\na. to monitor police conduct;\n\nb. to oversee the effectiveness and efficiency of the police service, including receiving reports on the police service;\n\nc. to promote good relations between the police and the community;\n\nd. to assess the effectiveness of visible policing; and\n\ne. to liaise with the Cabinet member responsible for policing with respect to crime and policing in the province.\n\n4. A provincial executive is responsible for policing functions ­\n\na. vested in it by this Chapter;\n\nb. assigned to it in terms of national legislation; and\n\nc. allocated to it in the national policing policy.\n\n5. In order to perform the functions set out in subsection (3), a province ­\n\na. may investigate, or appoint a commission of inquiry into, any complaints of police inefficiency or a breakdown in relations between the police and any community; and\n\nb. must make recommendations to the Cabinet member responsible for policing.\n\n6. On receipt of a complaint lodged by a provincial executive, an independent police complaints body established by national legislation must investigate any alleged misconduct of, or offence committed by, a member of the police service in the province.\n\n7. National legislation must provide a framework for the establishment, powers, functions and control of municipal police services.\n\n8. A committee composed of the Cabinet member and the members of the Executive Councils responsible for policing must be established to ensure effective co-ordination of the police service and effective co-operation among the spheres of government.\n\n9. A provincial legislature may require the provincial commissioner of the province to appear before it or any of its committees to answer questions.\n\n207. Control of police service\n\n1. The President as head of the national executive must appoint a woman or a man as the National Commissioner of the police service, to control and manage the police service.\n\n2. The National Commissioner must exercise control over and manage the police service in accordance with the national policing policy and the directions of the Cabinet member responsible for policing.\n\n3. The National Commissioner, with the concurrence of the provincial executive, must appoint a woman or a man as the provincial commissioner for that province, but if the National Commissioner and the provincial executive are unable to agree on the appointment, the Cabinet member responsible for policing must mediate between the parties.\n\n4. The provincial commissioners are responsible for policing in their respective provinces ­\n\na. as prescribed by national legislation; and\n\nb. subject to the power of the National Commissioner to exercise control over and manage the police service in terms of subsection (2).\n\n5. The provincial commissioner must report to the provincial legislature annually on policing in the province, and must send a copy of the report to the National Commissioner.\n\n6. If the provincial commissioner has lost the confidence of the provincial executive, that executive may institute appropriate proceedings for the removal or transfer of, or disciplinary action against, that commissioner, in accordance with national legislation.\n\n208. Police civilian secretariat\n\nA civilian secretariat for the police service must be established by national legislation to function under the direction of the Cabinet member responsible for policing.\n\nIntelligence\n\n209. Establishment and control of intelligence services\n\n1. Any intelligence service, other than any intelligence division of the defence force or police service, may be established only by the President, as head of the national executive, and only in terms of national legislation.\n\n2. The President as head of the national executive must appoint a woman or a man as head of each intelligence service established in terms of subsection (1), and must either assume political responsibility for the control and direction of any of those services, or designate a member of the Cabinet to assume that responsibility.\n\n210. Powers, functions and monitoring\n\nNational legislation must regulate the objects, powers and functions of the intelligence services, including any intelligence division of the defence force or police service, and must provide for ­\n\na. the co-ordination of all intelligence services; and\n\nb. civilian monitoring of the activities of those services by an inspector appointed by the President, as head of the national executive, and approved by a resolution adopted by the National Assembly with a supporting vote of at least two thirds of its members.\n\n- Translation in all official languages",
  "https://www.gov.za/documents/notices/constitution-republic-south-africa-1996-chapter-12-traditional-leaders-07-feb": "Constitution of the Republic of South Africa, 1996 - Chapter 12: Traditional Leaders211. Recognition\n1. The institution, status and role of traditional leadership, according to customary law, are recognised, subject to the Constitution.\n2. A traditional authority that observes a system of customary law may function subject to any applicable legislation and customs, which includes amendments to, or repeal of, that legislation or those customs.\n3. The courts must apply customary law when that law is applicable, subject to the Constitution and any legislation that specifically deals with customary law.\n212. Role of traditional leaders\n1. National legislation may provide for a role for traditional leadership as an institution at local level on matters affecting local communities.\n2. To deal with matters relating to traditional leadership, the role of traditional leaders, customary law and the customs of communities observing a system of customary law ­\na. national or provincial legislation may provide for the establishment of houses of traditional leaders; and\nb. national legislation may establish a council of traditional leaders.",
  "https://www.gov.za/documents/constitution/constitution-republic-south-africa-1996-chapter-13-finance-07-feb-1997": "The text below includes all amendments , up to and including the 17th Amendment to the Constitution ( disclaimer ).\n\nGeneral Financial Matters\n\nNational Revenue Fund\n\nEquitable shares and allocations of revenue\n\nNational, provincial and municipal budgets\n\nTreasury control\n\nProcurement\n\nGovernment guarantees\n\nRemuneration of persons holding public office\n\nFinancial and Fiscal Commission\n\nEstablishment and functions\n\nAppointment and tenure of members\n\nReports\n\nCentral Bank\n\nEstablishment\n\nPrimary object\n\nPowers and functions\n\nProvincial and Local Financial Matters\n\nProvincial Revenue Funds\n\nNational sources of provincial and local government funding\n\nProvincial taxes\n\nMunicipal fiscal powers and functions\n\nProvincial and municipal loans\n\nGeneral Financial Matters\n\n213. National Revenue Fund\n\n1. There is a National Revenue Fund into which all money received by the national government must be paid, except money reasonably excluded by an Act of Parliament.\n\n2. Money may be withdrawn from the National Revenue Fund only ­\n\na. in terms of an appropriation by an Act of Parliament; or\n\nb. as a direct charge against the National Revenue Fund, when it is provided for in the Constitution or an Act of Parliament.\n\n3. A province's equitable share of revenue raised nationally is a direct charge against the National Revenue Fund.\n\n(Date of commencement: 1 January 1998.)\n\n214. Equitable shares and allocations of revenue\n\n1. An Act of Parliament must provide for ­\n\na. the equitable division of revenue raised nationally among the national, provincial and local spheres of government;\n\nb. the determination of each province's equitable share of the provincial share of that revenue; and\n\nc. any other allocations to provinces, local government or municipalities from the national government's share of that revenue, and any conditions on which those allocations may be made.\n\n2. The Act referred to in subsection (1) may be enacted only after the provincial governments, organised local government and the Financial and Fiscal Commission have been consulted, and any recommendations of the Commission have been considered, and must take into account ­\n\na. the national interest;\n\nb. any provision that must be made in respect of the national debt and other national obligations;\n\nc. the needs and interests of the national government, determined by objective criteria;\n\nd. the need to ensure that the provinces and municipalities are able to provide basic services and perform the functions allocated to them;\n\ne. the fiscal capacity and efficiency of the provinces and municipalities;\n\nf. developmental and other needs of provinces, local government and municipalities;\n\ng. economic disparities within and among the provinces;\n\nh. obligations of the provinces and municipalities in terms of national legislation;\n\ni. the desirability of stable and predictable allocations of revenue shares; and\n\nj. the need for flexibility in responding to emergencies or other temporary needs, and other factors based on similar objective criteria.\n\n(Date of commencement: 1 January, 1998.)\n\n215. National, provincial and municipal budgets\n\n1. National, provincial and municipal budgets and budgetary processes must promote transparency, accountability and the effective financial management of the economy, debt and the public sector.\n\n2. National legislation must prescribe ­\n\na. the form of national, provincial and municipal budgets;\n\nb. when national and provincial budgets must be tabled; and\n\nc. that budgets in each sphere of government must show the sources of revenue and the way in which proposed expenditure will comply with national legislation.\n\n3. Budgets in each sphere of government must contain ­\n\na. estimates of revenue and expenditure, differentiating between capital and current expenditure;\n\nb. proposals for financing any anticipated deficit for the period to which they apply; and\n\nc. an indication of intentions regarding borrowing and other forms of public liability that will increase public debt during the ensuing year.\n\n(Date of commencement: 1 January, 1998.)\n\n216. Treasury control\n\n1. National legislation must establish a national treasury and prescribe measures to ensure both transparency and expenditure control in each sphere of government, by introducing ­\n\na. generally recognised accounting practice;\n\nb. uniform expenditure classifications; and\n\nc. uniform treasury norms and standards.\n\n2. The national treasury must enforce compliance with the measures established in terms of subsection (1), and may stop the transfer of funds to an organ of state if that organ of state commits a serious or persistent material breach of those measures.\n\n[Sub-s (2) substituted by s. 5 (a) of Act No. 61 of 2001.]\n\n3. A decision to stop the transfer of funds due to a province in terms of section 214 (1) (b) may be taken only in the circumstances mentioned in subsection (2), and-\n\na. may not stop the transfer of funds for more than 120 days; and\n\nb. may be enforced immediately, but will lapse retrospectively unless Parliament approves it following a process substantially the same as that established in terms of section 76(1) and prescribed by the joint rules and orders of Parliament. This process must be completed within 30 days of the decision by the national treasury.\n\n[Sub-s. (3) amended by s. 5 (b) of Act No. 61 of 2001.]\n\n4. Parliament may renew a decision to stop the transfer of funds for no more than 120 days at a time, following the process established in terms of subsection (3).\n\n5. Before Parliament may approve or renew a decision to stop the transfer of funds to a province ­\n\na. the Auditor-General must report to Parliament; and\n\nb. the province must be given an opportunity to answer the allegations against it, and to state its case, before a committee.\n\n(Date of commencement: 1 January, 1998.)\n\n217. Procurement\n\n1. When an organ of state in the national, provincial or local sphere of government, or any other institution identified in national legislation, contracts for goods or services, it must do so in accordance with a system which is fair, equitable, transparent, competitive and cost-effective.\n\n2. Subsection (1) does not prevent the organs of state or institutions referred to in that subsection from implementing a procurement policy providing for ­\n\na. categories of preference in the allocation of contracts; and\n\nb. the protection or advancement of persons, or categories of persons, disadvantaged by unfair discrimination.\n\n3. National legislation must prescribe a framework within which the policy referred to in subsection (2) must be implemented.\n\n[Sub-s. (3) substituted by s. 6 of Act No. 61 of 2001.]\n\n218. Government guarantees\n\n1. The national government, a provincial government or a municipality may guarantee a loan only if the guarantee complies with any conditions set out in national legislation.\n\n2. National legislation referred to in subsection (1) may be enacted only after any recommendations of the Financial and Fiscal Commission have been considered.\n\n3. Each year, every government must publish a report on the guarantees it has granted.\n\n(Date of commencement: 1 January, 1998.)\n\n219. Remuneration of persons holding public office\n\n1. An Act of Parliament must establish a framework for determining-\n\na. the salaries, allowances and benefits of members of the National Assembly, permanent delegates to the National Council of Provinces, members of the Cabinet, Deputy Ministers, traditional leaders and members of any councils of traditional leaders; and\n\nb. the upper limit of salaries, allowances or benefits of members of provincial legislatures, members of Executive Councils and members of Municipal Councils of the different categories.\n\n2. National legislation must establish an independent commission to make recommendations concerning the salaries, allowances and benefits referred to in subsection (1).\n\n3. Parliament may pass the legislation referred to in subsection (1) only after considering any recommendations of the commission established in terms of subsection (2).\n\n4. The national executive, a provincial executive, a municipality or any other relevant authority may implement the national legislation referred to in subsection (1) only after considering any recommendations of the commission established in terms of subsection (2).\n\n5. National legislation must establish frameworks for determining the salaries, allowances and benefits of judges, the Public Protector, the Auditor-General, and members of any commission provided for in the Constitution, including the broadcasting authority referred to in section 192.\n\nFinancial and Fiscal Commission\n\n220. Establishment and functions\n\n1. There is a Financial and Fiscal Commission for the Republic which makes recommendations envisaged in this Chapter, or in national legislation, to Parliament, provincial legislatures and any other authorities determined by national legislation.\n\n2. The Commission is independent and subject only to the Constitution and the law, and must be impartial.\n\n3. The Commission must function in terms of an Act of Parliament and, in performing its functions, must consider all relevant factors, including those listed in section 214(2).\n\n221. Appointment and tenure of members\n\n1. The Commission consists of the following women and men appointed by the President, as head of the national executive:\n\na. A chairperson and deputy chairperson;\n\nb. three persons selected, after consulting the Premiers, from a list compiled in accordance with a process prescribed by national legislation;\n\nc. two persons selected, after consulting organised local government, from a list compiled in accordance with a process prescribed national legislation; and\n\nd. two other persons.\n\n[Sub-s. (1) amended by s. 2 of Act No. 2 of 1999 and substituted by s. 7 (a) of Act No. 61 of 2001.]\n\n1A. National legislation referred to in subsection (1) must provide for the participation of -\n\na. the Premiers in the compilation of a list envisaged in subsection (1) (b); and\n\nb. organised local government in the compilation of a list envisaged in subsection (1) (c).\n\n[Sub-s. (1A) inserted by s. 7 (b) of Act No. 61 of 2001.]\n\n2. Members of the Commission must have appropriate expertise.\n\n3. Members serve for a term established in terms of national legislation. The President may remove a member from office on the ground of misconduct, incapacity or incompetence.\n\n222. Reports\n\nThe Commission must report regularly both to Parliament and to the provincial legislatures.\n\nCentral Bank\n\n223. Establishment\n\nThe South African Reserve Bank is the central bank of the Republic and is regulated in terms of an Act of Parliament.\n\n224. Primary object\n\n1. The primary object of the South African Reserve Bank is to protect the value of the currency in the interest of balanced and sustainable economic growth in the Republic.\n\n2. The South African Reserve Bank, in pursuit of its primary object, must perform its functions independently and without fear, favour or prejudice, but there must be regular consultation between the Bank and the Cabinet member responsible for national financial matters.\n\n225. Powers and functions\n\nThe powers and functions of the South African Reserve Bank are those customarily exercised and performed by central banks, which powers and functions must be determined by an Act of Parliament and must be exercised or performed subject to the conditions prescribed in terms of that Act.\n\nProvincial and Local Financial Matters\n\n226. Provincial Revenue Funds\n\n1. There is a Provincial Revenue Fund for each province into which all money received by the provincial government must be paid, except money reasonably excluded by an Act of Parliament.\n\n2. Money may be withdrawn from a Provincial Revenue Fund only ­\n\na. in terms of an appropriation by a provincial Act; or\n\nb. as a direct charge against the Provincial Revenue Fund, when it is provided for in the Constitution or a provincial Act.\n\n3. Revenue allocated through a province to local government in that province in terms of section 214(1), is a direct charge against that province's Revenue Fund.\n\n4. National legislation may determine a framework within which-\n\na. a provincial Act may in terms of subsection (2) (b) authorise the withdrawal of money as a direct charge against a Provincial Revenue Fund; and\n\nb. revenue allocated through a province to local government in that province in terms of subsection (3) must be paid to municipalities in the province.\n\n[Sub-s. (4) added by s. 8 of Act No. 61 of 2001.] (Date of commencement: 1 January 1998.)\n\n227. National sources of provincial and local government funding\n\n1. Local government and each province ­\n\na. is entitled to an equitable share of revenue raised nationally to enable it to provide basic services and perform the functions allocated to it; and\n\nb. may receive other allocations from national government revenue, either conditionally or unconditionally.\n\n2. Additional revenue raised by provinces or municipalities may not be deducted from their share of revenue raised nationally, or from other allocations made to them out of national government revenue. Equally, there is no obligation on the national government to compensate provinces or municipalities that do not raise revenue commensurate with their fiscal capacity and tax base.\n\n3. A province's equitable share of revenue raised nationally must be transferred to the province promptly and without deduction, except when the transfer has been stopped in terms of section 216.\n\n4. A province must provide for itself any resources that it requires, in terms of a provision of its provincial constitution, that are additional to its requirements envisaged in the Constitution.\n\n(Date of commencement: 1 January, 1998.)\n\n228. Provincial taxes\n\n1. A provincial legislature may impose ­\n\na. taxes, levies and duties other than income tax, value-added tax, general sales tax, rates on property or customs duties; and\n\nb. flat-rate surcharges on any tax, levy or duty that is imposed by national legislation, other than on corporate income tax, value-added tax, rates on property or custom duties.\n\n[Para. (b) substituted by s. 9 of Act No. 61 of 2001.]\n\n2. The power of a provincial legislature to impose taxes, levies, duties and surcharges ­\n\na. may not be exercised in a way that materially and unreasonably prejudices national economic policies, economic activities across provincial boundaries, or the national mobility of goods, services,  capital  or labour; and\n\nb. must be regulated in terms of an Act of Parliament, which may be enacted only after any recommendations of the Financial and Fiscal Commission have been considered.\n\n(Date of commencement: 1 January, 1998.)\n\n229. Municipal fiscal powers and functions\n\n1. Subject to subsections (2), (3) and (4), a municipality may impose ­\n\na. rates on property and surcharges on fees for services provided by or on behalf of the municipality; and\n\nb. if authorised by national legislation, other taxes, levies and duties appropriate to local government or to the category of local government into which that municipality falls, but no municipality may impose income tax, value-added tax, general sales tax or customs duty.\n\n2. The power of a municipality to impose rates on property, surcharges on fees for services provided by or on behalf of the municipality, or other taxes, levies or duties ­\n\na. may not be exercised in a way that materially and unreasonably prejudices national economic policies, economic activities across municipal boundaries, or the national mobility of goods, services, capital or labour; and\n\nb. may be regulated by national legislation.\n\n3. When two municipalities have the same fiscal powers and functions with regard to the same area, an appropriate division of those powers and functions must be made in terms of national legislation. The division may be made only after taking into account at least the following criteria:\n\na. The need to comply with sound principles of taxation.\n\nb. The powers and functions performed by each municipality.\n\nc. The fiscal capacity of each municipality.\n\nd. The effectiveness and efficiency of raising taxes, levies and duties.\n\ne. Equity.\n\n4. Nothing in this section precludes the sharing of revenue raised in terms of this section between municipalities that have fiscal power and functions in the same area.\n\n5. National legislation envisaged in this section may be enacted only after organised local government and the Financial and Fiscal Commission have been consulted, and any recommendations of the Commission have been considered.\n\n(Date of commencement: 1 January, 1998.)\n\n230. Provincial loans\n\n1. A province may raise loans for capital or current expenditure in accordance with national legislation, but loans for current expenditure may be raised only when necessary for bridging purposes during a fiscal year.\n\n2. National legislation referred to in subsection (1) may be enacted only after any recommendations of the Financial and Fiscal Commission have been considered.\n\n[S. 230 substituted by s. 10 of Act No. 61 of 2001.]\n\n230A. Municipal loans\n\n1. A Municipal Council may, in accordance with national legislation-\n\na. raise loans for capital or current expenditure for the municipality, but loans for current expenditure may be raised only when necessary for bridging purposes during a fiscal year; and\n\nb. bind itself and a future Council in the exercise of its legislative and executive authority to secure loans or investments for the municipality.\n\n2. National legislation referred to in subsection (1) may be enacted only after any recommendations of the Financial and Fiscal Commission have been considered.\n\n[S. 230A inserted by s. 17 of Act No. 34 of 2001.]\n\n- Translation in all official languages",
  "https://www.gov.za/documents/constitution/constitution-republic-south-africa-1996-chapter-14-general-provisions-07-feb": "International Law\n\n231. International agreements 232. Customary international law 233. Application of international law\n\nOther Matters\n\n234. Charters of Rights 235. Self-determination 236. Funding for political parties 237. Diligent performance of obligations 238. Agency and delegation 239. Definitions 240. Inconsistencies between different texts 241. Transitional arrangements 242. Repeal of laws 243. Short title and commencement\n\nInternational Law\n\n231. International agreements\n\n1. The negotiating and signing of all international agreements is the responsibility of the national executive.\n\n2. An international agreement binds the Republic only after it has been approved by resolution in both the National Assembly and the National Council of Provinces, unless it is an agreement referred to in subsection (3).\n\n3. An international agreement of a technical, administrative or executive nature, or an agreement which does not require either ratification or accession, entered into by the national executive, binds the Republic without approval by the National Assembly and the National Council of Provinces, but must be tabled in the Assembly and the Council within a reasonable time.\n\n4. Any international agreement becomes law in the Republic when it is enacted into law by national legislation; but a self-executing provision of an agreement that has been approved by Parliament is law in the Republic unless it is inconsistent with the Constitution or an Act of Parliament.\n\n5. The Republic is bound by international agreements which were binding on the Republic when this Constitution took effect.\n\n232. Customary international law\n\nCustomary international law is law in the Republic unless it is inconsistent with the Constitution or an Act of Parliament.\n\n233. Application of international law\n\nWhen interpreting any legislation, every court must prefer any reasonable interpretation of the legislation that is consistent with international law over any alternative interpretation that is inconsistent with international law.\n\nOther matters\n\n234. Charters of Rights\n\nIn order to deepen the culture of democracy established by the Constitution, Parliament may adopt Charters of Rights consistent with the provisions of the Constitution.\n\n235. Self-determination\n\nThe right of the South African people as a whole to self-determination, as manifested in this Constitution, does not preclude, within the framework of this right, recognition of the notion of the right of self-determination of any community sharing a common cultural and language heritage, within a territorial entity in the Republic or in any other way, determined by national legislation.\n\n236. Funding for political parties\n\nTo enhance multi-party democracy, national legislation must provide for the funding of political parties participating in national and provincial legislatures on an equitable and proportional basis.\n\n237. Diligent performance of obligations\n\nAll constitutional obligations must be performed diligently and without delay.\n\n238. Agency and delegation\n\nAn executive organ of state in any sphere of government may ­\n\na. delegate any power or function that is to be exercised or performed in terms of legislation to any other executive organ of state, provided the delegation is consistent with the legislation in terms of which the power is exercised or the function is performed; or\n\nb. exercise any power or perform any function for any other executive organ of state on an agency or delegation basis.\n\n239. Definitions\n\nIn the Constitution, unless the context indicates otherwise ­\n\n\"national legislation\" includes ­\n\na. subordinate legislation made in terms of an Act of Parliament; and\n\nb. legislation that was in force when the Constitution took effect and that is administered by the national government;\n\n\"organ of state\" means ­\n\na. any department of state or administration in the national, provincial or local sphere of government; or\n\nb. any other functionary or institution ­\n\ni. exercising a power or performing a function in terms of the Constitution or a provincial constitution; or\n\nii. exercising a public power or performing a public function in terms of any legislation, but does not include a court or a judicial officer;\n\n\"provincial legislation\" includes ­\n\na. subordinate legislation made in terms of a provincial Act; and\n\nb. legislation that was in force when the Constitution took effect and that is administered by a provincial government.\n\n240. Inconsistencies between different texts\n\nIn the event of an inconsistency between different texts of the Constitution, the English text prevails.\n\n241. Transitional arrangements\n\nSchedule 6 applies to the transition to the new constitutional order established by this Constitution, and any matter incidental to that transition.\n\n242. Repeal of laws\n\nThe laws mentioned in Schedule 7 are repealed, subject to section 243 and Schedule 6 .\n\n243. Short title and commencement\n\n1. This Act is called the Constitution of the Republic of South Africa, 1996, and comes into effect as soon as possible on a date set by the President by proclamation, which may not be a date later than 1 July 1997.\n\n2. The President may set different dates before the date mentioned in subsection (1) in respect of different provisions of the Constitution.\n\n3. Unless the context otherwise indicates, a reference in a provision of the Constitution to a time when the Constitution took effect must be construed as a reference to the time when that provision took effect.\n\n4. If a different date is set for any particular provision of the Constitution in terms of subsection (2), any corresponding provision of the Constitution of the Republic of South Africa, 1993 (Act 200 of 1993), mentioned in the proclamation, is repealed with effect from the same date.\n\n5. Sections 213, 214, 215, 216, 218, 226, 227, 228, 229 and 230 come into effect on 1 January 1998, but this does not preclude the enactment in terms of this Constitution of legislation envisaged in any of these provisions before that date. Until that date any corresponding and incidental provisions of the Constitution of the Republic of South Africa, 1993, remain in force.\n\n- Translation in all official languages"
}